una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
/* Interrupt Clear-Enable Registers 0-31 */
typedef struct {
  __REG32  ISP32        : 1;
  __REG32  ISP33        : 1;
  __REG32  ISP34        : 1;
  __REG32  ISP35        : 1;
  __REG32  ISP36        : 1;
  __REG32  ISP37        : 1;
  __REG32  ISP38        : 1;
  __REG32  ISP39        : 1;
  __REG32  ISP40        : 1;
  __REG32  ISP41        : 1;
  __REG32  ISP42        : 1;
  __REG32  ISP43        : 1;
  __REG32  ISP44        : 1;
  __REG32  ISP45        : 1;
  __REG32  ISP46        : 1;
  __REG32  ISP47        : 1;
  __REG32  ISP48        : 1;
  __REG32  ISP49        : 1;
  __REG32  ISP50        : 1;
  __REG32  ISP51        : 1;
  __REG32  ISP52        : 1;
  __REG32               :11;
} __nvic_ispr1_bits;

/* Interrupt Clear-Pending Register 0-31 */
typedef struct {
  __REG32  ICP0        : 1;
  __REG32  ICP1        : 1;
  __REG32  ICP2        : 1;
  __REG32  ICP3        : 1;
  __REG32  ICP4        : 1;
  __REG32  ICP5        : 1;
  __REG32  ICP6        : 1;
  __REG32  ICP7        : 1;
  __REG32  ICP8        : 1;
  __REG32  ICP9        : 1;
  __REG32  ICP10       : 1;
  __REG32  ICP11       : 1;
  __REG32  ICP12       : 1;
  __REG32  ICP13       : 1;
  __REG32  ICP14       : 1;
  __REG32  ICP15       : 1;
  __REG32  ICP16       : 1;
  __REG32  ICP17       : 1;
  __REG32  ICP18       : 1;
  __REG32  ICP19       : 1;
  __REG32  ICP20       : 1;
  __REG32  ICP21       : 1;
  __REG32  ICP22       : 1;
  __REG32  ICP23       : 1;
  __REG32  ICP24       : 1;
  __REG32  ICP25       : 1;
  __REG32  ICP26       : 1;
  __REG32  ICP27       : 1;
  __REG32  ICP28       : 1;
  __REG32  ICP29       : 1;
  __REG32  ICP30       : 1;
  __REG32  ICP31       : 1;
} __nvic_icpr0_bits;

/* Interrupt Clear-Pending Register 0-31 */
typedef struct {
  __REG32  ICP32        : 1;
  __REG32  ICP33        : 1;
  __REG32  ICP34        : 1;
  __REG32  ICP35        : 1;
  __REG32  ICP36        : 1;
  __REG32  ICP37        : 1;
  __REG32  ICP38        : 1;
  __REG32  ICP39        : 1;
  __REG32  ICP40        : 1;
  __REG32  ICP41        : 1;
  __REG32  ICP42        : 1;
  __REG32  ICP43        : 1;
  __REG32  ICP44        : 1;
  __REG32  ICP45        : 1;
  __REG32  ICP46        : 1;
  __REG32  ICP47        : 1;
  __REG32  ICP48        : 1;
  __REG32  ICP49        : 1;
  __REG32  ICP50        : 1;
  __REG32  ICP51        : 1;
  __REG32  ICP52        : 1;
  __REG32               :11;
} __nvic_icpr1_bits;

/* Active Bit Register 0-31 */
typedef struct {
  __REG32  IABP0        : 1;
  __REG32  IABP1        : 1;
  __REG32  IABP2        : 1;
  __REG32  IABP3        : 1;
  __REG32  IABP4        : 1;
  __REG32  IABP5        : 1;
  __REG32  IABP6        : 1;
  __REG32  IABP7        : 1;
  __REG32  IABP8        : 1;
  __REG32  IABP9        : 1;
  __REG32  IABP10       : 1;
  __REG32  IABP11       : 1;
  __REG32  IABP12       : 1;
  __REG32  IABP13       : 1;
  __REG32  IABP14       : 1;
  __REG32  IABP15       : 1;
  __REG32  IABP16       : 1;
  __REG32  IABP17       : 1;
  __REG32  IABP18       : 1;
  __REG32  IABP19       : 1;
  __REG32  IABP20       : 1;
  __REG32  IABP21       : 1;
  __REG32  IABP22       : 1;
  __REG32  IABP23       : 1;
  __REG32  IABP24       : 1;
  __REG32  IABP25       : 1;
  __REG32  IABP26       : 1;
  __REG32  IABP27       : 1;
  __REG32  IABP28       : 1;
  __REG32  IABP29       : 1;
  __REG32  IABP30       : 1;
  __REG32  IABP31       : 1;
} __nvic_iabr0_bits;

/* Active Bit Register 0-31 */
typedef struct {
  __REG32  IABP32        : 1;
  __REG32  IABP33        : 1;
  __REG32  IABP34        : 1;
  __REG32  IABP35        : 1;
  __REG32  IABP36        : 1;
  __REG32  IABP37        : 1;
  __REG32  IABP38        : 1;
  __REG32  IABP39        : 1;
  __REG32  IABP40        : 1;
  __REG32  IABP41        : 1;
  __REG32  IABP42        : 1;
  __REG32  IABP43        : 1;
  __REG32  IABP44        : 1;
  __REG32  IABP45        : 1;
  __REG32  IABP46        : 1;
  __REG32  IABP47        : 1;
  __REG32  IABP48        : 1;
  __REG32  IABP49        : 1;
  __REG32  IABP50        : 1;
  __REG32  IABP51        : 1;
  __REG32  IABP52        : 1;
  __REG32                :11;
} __nvic_iabr1_bits;


/* Interrupt Priority Registers 0-3 */
typedef struct {
  __REG32  IP0            : 8;
  __REG32  IP1            : 8;
  __REG32  IP2            : 8;
  __REG32  IP3            : 8;
} __nvic_ipr0_bits;

/* Interrupt Priority Registers 4-7 */
typedef struct {
  __REG32  IP4            : 8;
  __REG32  IP5            : 8;
  __REG32  IP6            : 8;
  __REG32  IP7            : 8;
} __nvic_ipr1_bits;

/* Interrupt Priority Registers 8-11 */
typedef struct {
  __REG32  IP8           : 8;
  __REG32  IP9           : 8;
  __REG32  IP10          : 8;
  __REG32  IP11          : 8;
} __nvic_ipr2_bits;

/* Interrupt Priority Registers 12-15 */
typedef struct {
  __REG32  IP12          : 8;
  __REG32  IP13          : 8;
  __REG32  IP14          : 8;
  __REG32  IP15          : 8;
} __nvic_ipr3_bits;

/* Interrupt Priority Registers 16-19 */
typedef struct {
  __REG32  IP16          : 8;
  __REG32  IP17          : 8;
  __REG32  IP18          : 8;
  __REG32  IP19          : 8;
} __nvic_ipr4_bits;

/* Interrupt Priority Registers 20-23 */
typedef struct {
  __REG32  IP20          : 8;
  __REG32  IP21          : 8;
  __REG32  IP22          : 8;
  __REG32  IP23          : 8;
} __nvic_ipr5_bits;

/* Interrupt Priority Registers 24-27 */
typedef struct {
  __REG32  IP24          : 8;
  __REG32  IP25          : 8;
  __REG32  IP26          : 8;
  __REG32  IP27          : 8;
} __nvic_ipr6_bits;

/* Interrupt Priority Registers 28-31 */
typedef struct {
  __REG32  IP28          : 8;
  __REG32  IP29          : 8;
  __REG32  IP30          : 8;
  __REG32  IP31          : 8;
} __nvic_ipr7_bits;

/* Interrupt Priority Registers 32-35 */
typedef struct {
  __REG32  IP32          : 8;
  __REG32  IP33          : 8;
  __REG32  IP34          : 8;
  __REG32  IP35          : 8;
} __nvic_ipr8_bits;

/* Interrupt Priority Registers 36-39 */
typedef struct {
  __REG32  IP36          : 8;
  __REG32  IP37          : 8;
  __REG32  IP38          : 8;
  __REG32  IP39          : 8;
} __nvic_ipr9_bits;

/* Interrupt  Priority Registers 40-43 */
typedef struct {
  __REG32  IP40          : 8;
  __REG32  IP41          : 8;
  __REG32  IP42          : 8;
  __REG32  IP43          : 8;
} __nvic_ipr10_bits;

/* Interrupt Priority Registers 44-47 */
typedef struct {
  __REG32  IP44          : 8;
  __REG32  IP45          : 8;
  __REG32  IP46          : 8;
  __REG32  IP47          : 8;
} __nvic_ipr11_bits;

/* Interrupt Priority Registers 48-51 */
typedef struct {
  __REG32  IP48          : 8;
  __REG32  IP49          : 8;
  __REG32  IP50          : 8;
  __REG32  IP51          : 8;
} __nvic_ipr12_bits;

/* Interrupt Priority Register 52 */
typedef struct {
  __REG32  IP52          : 8;
  __REG32                :24;
} __nvic_ipr13_bits;


/* CPU ID Base Register */
typedef struct {
  __REG32  REVISION       : 4;
  __REG32  PARTNO         :12;
  __REG32  ARCHITECTURE   : 4;
  __REG32  VARIANT        : 4;
  __REG32  IMPLEMENTER    : 8;
} __cpuid_bits;

/* Interrupt Control State Register */
typedef struct {
  __REG32  VECTACTIVE     : 9;
  __REG32                 : 2;
  __REG32  RETTOBASE      : 1;
  __REG32  VECTPENDING    : 9;
  __REG32                 : 1;
  __REG32  ISRPENDING     : 1;
  __REG32  ISRPREEMPT     : 1;
  __REG32                 : 1;
  __REG32  PENDSTCLR      : 1;
  __REG32  PENDSTSET      : 1;
  __REG32  PENDSVCLR      : 1;
  __REG32  PENDSVSET      : 1;
  __REG32                 : 2;
  __REG32  NMIPENDSET     : 1;
} __icsr_bits;

/* Vector Table Offset Register */
typedef struct {
  __REG32                 : 7;
  __REG32  TBLOFF         :25;
} __vtor_bits;

/* Application Interrupt and Reset Control Register */
typedef struct {
  __REG32  VECTRESET      : 1;
  __REG32  VECTCLRACTIVE  : 1;
  __REG32  SYSRESETREQ    : 1;
  __REG32                 : 5;
  __REG32  PRIGROUP       : 3;
  __REG32                 : 4;
  __REG32  ENDIANESS      : 1;
  __REG32  VECTKEY        :16;
} __aircr_bits;

/* System Control Register */
typedef struct {
  __REG32                 : 1;
  __REG32  SLEEPONEXIT    : 1;
  __REG32  SLEEPDEEP      : 1;
  __REG32                 : 1;
  __REG32  SEVONPEND      : 1;
  __REG32                 :27;
} __scr_bits;

/* Configuration Control Register */
typedef struct {
  __REG32  NONEBASETHRDENA: 1;
  __REG32  USERSETMPEND   : 1;
  __REG32                 : 1;
  __REG32  UNALIGN_TRP    : 1;
  __REG32  DIV_0_TRP      : 1;
  __REG32                 : 3;
  __REG32  BFHFNMIGN      : 1;
  __REG32  STKALIGN       : 1;
  __REG32                 :22;
} __ccr_bits;

/* System Handler Control and State Register */
typedef struct {
  __REG32  MEMFAULTACT    : 1;
  __REG32  BUSFAULTACT    : 1;
  __REG32                 : 1;
  __REG32  USGFAULTACT    : 1;
  __REG32                 : 3;
  __REG32  SVCALLACT      : 1;
  __REG32  MONITORACT     : 1;
  __REG32                 : 1;
  __REG32  PENDSVACT      : 1;
  __REG32  SYSTICKACT     : 1;
  __REG32  USGFAULTPENDED : 1;
  __REG32  MEMFAULTPENDED : 1;
  __REG32  BUSFAULTPENDED : 1;
  __REG32  SVCALLPENDED   : 1;
  __REG32  MEMFAULTENA    : 1;
  __REG32  BUSFAULTENA    : 1;
  __REG32  USGFAULTENA    : 1;
  __REG32                 :13;
} __shcsr_bits;

