una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
/* Pin interrupt select register 1 */
typedef struct {
  __REG32  INTPIN4            : 5;
  __REG32  PORTSEL4           : 3;
  __REG32  INTPIN5            : 5;
  __REG32  PORTSEL5           : 3;
  __REG32  INTPIN6            : 5;
  __REG32  PORTSEL6           : 3;
  __REG32  INTPIN7            : 5;
  __REG32  PORTSEL7           : 3;
} __scu_pintsel1_bits;


/* Input multiplexer registers */
typedef struct {
  __REG32  INV                : 1;
  __REG32  EDGE               : 1;
  __REG32  SYNCH              : 1;
  __REG32  PULSE              : 1;
  __REG32  SELECT             : 4;
  __REG32                     :24;
} __gima_in_bits;


/* Pin interrupt mode register */
typedef struct {
  __REG32  PMODE              : 8;
  __REG32                     :24;
} __gpio_isel_bits;

/* Pin interrupt level enable register */
typedef struct {
  __REG32  ENRL               : 8;
  __REG32                     :24;
} __gpio_ienr_bits;

/* Pin interrupt level set register */

#define GPIO_SIENR_SETENRL         (0x000000FFUL)

/* Pin interrupt level clear register */

#define GPIO_CIENR_CENRL           (0x000000FFUL)

/* Pin interrupt active level register */
typedef struct {
  __REG32  ENAF               : 8;
  __REG32                     :24;
} __gpio_ienf_bits;

/* Pin interrupt active level set register */

#define GPIO_SIENF_SETENAF         (0x000000FFUL)

/* Pin interrupt active level clear register */

#define GPIO_CIENF_CENAF           (0x000000FFUL)

/* Pin interrupt rising edge register */
typedef struct {
  __REG32  RDET               : 8;
  __REG32                     :24;
} __gpio_rise_bits;

/* Pin interrupt falling edge register */
typedef struct {
  __REG32  FDET               : 8;
  __REG32                     :24;
} __gpio_fall_bits;

/* Pin interrupt status register */
typedef struct {
  __REG32  PSTAT              : 8;
  __REG32                     :24;
} __gpio_ist_bits;

/* Grouped interrupt control register */
typedef struct {
  __REG32  INT                : 1;
  __REG32  COMB               : 1;
  __REG32  TRIG               : 1;
  __REG32                     :29;
} __gpiogx_ctrl_bits;


/* Pin multiplexer configuration registers */
typedef struct {
  __REG32  P_OUT_CFG          : 4;
  __REG32  P_OE_CFG           : 3;
  __REG32                     :25;
} __sgpio_out_mux_cfgx_bits;

/* SGPIO multiplexer configuration registers */
typedef struct {
  __REG32  EXT_CLK_ENABLE        : 1;
  __REG32  CLK_SOURCE_PIN_MODE   : 2;
  __REG32  CLK_SOURCE_SLICE_MODE : 2;
  __REG32  QUALIFIER_MODE        : 2;
  __REG32  QUALIFIER_PIN_MODE    : 2;
  __REG32  QUALIFIER_SLICE_MODE  : 2;
  __REG32  CONCAT_ENABLE         : 1;
  __REG32  CONCAT_ORDER          : 2;
  __REG32                        :18;
} __sgpio_mux_cfgx_bits;

/* Slice multiplexer configuration registers */
typedef struct {
  __REG32  MATCH_MODE            : 1;
  __REG32  CLK_CAPTURE_MODE      : 1;
  __REG32  CLKGEN_MODE           : 1;
  __REG32  INV_OUT_CLK           : 1;
  __REG32  DATA_CAPTURE_MODE     : 2;
  __REG32  PARALLEL_MODE         : 2;
  __REG32  INV_QUALIFIER         : 1;
  __REG32                        :23;
} __sgpio_slice_mux_cfgx_bits;

/* Reload registers */
typedef struct {
  __REG32  PRESET                :12;
  __REG32                        :20;
} __sgpio_presetx_bits;

/* Down counter registers */
typedef struct {
  __REG32  COUNT                 :12;
  __REG32                        :20;
} __sgpio_countx_bits;

/* Position registers */
typedef struct {
  __REG32  POS                   : 8;
  __REG32  POS_RESET             : 8;
  __REG32                        :16;
} __sgpio_posx_bits;

/* GPIO input status register */
typedef struct {
  __REG32  GPIO_IN0              : 1;
  __REG32  GPIO_IN1              : 1;
  __REG32  GPIO_IN2              : 1;
  __REG32  GPIO_IN3              : 1;
  __REG32  GPIO_IN4              : 1;
  __REG32  GPIO_IN5              : 1;
  __REG32  GPIO_IN6              : 1;
  __REG32  GPIO_IN7              : 1;
  __REG32  GPIO_IN8              : 1;
  __REG32  GPIO_IN9              : 1;
  __REG32  GPIO_IN10             : 1;
  __REG32  GPIO_IN11             : 1;
  __REG32  GPIO_IN12             : 1;
  __REG32  GPIO_IN13             : 1;
  __REG32  GPIO_IN14             : 1;
  __REG32  GPIO_IN15             : 1;
  __REG32                        :16;
} __sgpio_gpio_inreg_bits;

/* GPIO output control register */
typedef struct {
  __REG32  GPIO_OUT0             : 1;
  __REG32  GPIO_OUT1             : 1;
  __REG32  GPIO_OUT2             : 1;
  __REG32  GPIO_OUT3             : 1;
  __REG32  GPIO_OUT4             : 1;
  __REG32  GPIO_OUT5             : 1;
  __REG32  GPIO_OUT6             : 1;
  __REG32  GPIO_OUT7             : 1;
  __REG32  GPIO_OUT8             : 1;
  __REG32  GPIO_OUT9             : 1;
  __REG32  GPIO_OUT10            : 1;
  __REG32  GPIO_OUT11            : 1;
  __REG32  GPIO_OUT12            : 1;
  __REG32  GPIO_OUT13            : 1;
  __REG32  GPIO_OUT14            : 1;
  __REG32  GPIO_OUT15            : 1;
  __REG32                        :16;
} __sgpio_gpio_outreg_bits;

/* GPIO output enable register */
typedef struct {
  __REG32  GPIO_OE0             : 1;
  __REG32  GPIO_OE1             : 1;
  __REG32  GPIO_OE2             : 1;
  __REG32  GPIO_OE3             : 1;
  __REG32  GPIO_OE4             : 1;
  __REG32  GPIO_OE5             : 1;
  __REG32  GPIO_OE6             : 1;
  __REG32  GPIO_OE7             : 1;
  __REG32  GPIO_OE8             : 1;
  __REG32  GPIO_OE9             : 1;
  __REG32  GPIO_OE10            : 1;
  __REG32  GPIO_OE11            : 1;
  __REG32  GPIO_OE12            : 1;
  __REG32  GPIO_OE13            : 1;
  __REG32  GPIO_OE14            : 1;
  __REG32  GPIO_OE15            : 1;
  __REG32                        :16;
} __sgpio_gpio_oenreg_bits;

/* Slice count enable register */
typedef struct {
  __REG32  CTRL_ENABLED0         : 1;
  __REG32  CTRL_ENABLED1         : 1;
  __REG32  CTRL_ENABLED2         : 1;
  __REG32  CTRL_ENABLED3         : 1;
  __REG32  CTRL_ENABLED4         : 1;
  __REG32  CTRL_ENABLED5         : 1;
  __REG32  CTRL_ENABLED6         : 1;
  __REG32  CTRL_ENABLED7         : 1;
  __REG32  CTRL_ENABLED8         : 1;
  __REG32  CTRL_ENABLED9         : 1;
  __REG32  CTRL_ENABLED10        : 1;
  __REG32  CTRL_ENABLED11        : 1;
  __REG32  CTRL_ENABLED12        : 1;
  __REG32  CTRL_ENABLED13        : 1;
  __REG32  CTRL_ENABLED14        : 1;
  __REG32  CTRL_ENABLED15        : 1;
  __REG32                        :16;
} __sgpio_ctrl_enabled_bits;

/* Slice count disable register */
typedef struct {
  __REG32  CTRL_DISABLED0        : 1;
  __REG32  CTRL_DISABLED1        : 1;
  __REG32  CTRL_DISABLED2        : 1;
  __REG32  CTRL_DISABLED3        : 1;
  __REG32  CTRL_DISABLED4        : 1;
  __REG32  CTRL_DISABLED5        : 1;
  __REG32  CTRL_DISABLED6        : 1;
  __REG32  CTRL_DISABLED7        : 1;
  __REG32  CTRL_DISABLED8        : 1;
  __REG32  CTRL_DISABLED9        : 1;
  __REG32  CTRL_DISABLED10       : 1;
  __REG32  CTRL_DISABLED11       : 1;
  __REG32  CTRL_DISABLED12       : 1;
  __REG32  CTRL_DISABLED13       : 1;
  __REG32  CTRL_DISABLED14       : 1;
  __REG32  CTRL_DISABLED15       : 1;
  __REG32                        :16;
} __sgpio_ctrl_disabled_bits;

