una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
/* DMA Interrupt Terminal Count Request Status Register */
typedef struct{
__REG32 INTTCSTAT0  : 1;
__REG32 INTTCSTAT1  : 1;
__REG32 INTTCSTAT2  : 1;
__REG32 INTTCSTAT3  : 1;
__REG32 INTTCSTAT4  : 1;
__REG32 INTTCSTAT5  : 1;
__REG32 INTTCSTAT6  : 1;
__REG32 INTTCSTAT7  : 1;
__REG32               :24;
} __dmacinttcstatus_bits;

/* DMA Interrupt Terminal Count Request Clear Register */

#define GPDMA_INTTCCLEAR_INTTCCLEAR       (0x000000FFUL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR0      (0x00000001UL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR1      (0x00000002UL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR2      (0x00000004UL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR3      (0x00000008UL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR4      (0x00000010UL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR5      (0x00000020UL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR6      (0x00000040UL)
#define GPDMA_INTTCCLEAR_INTTCCLEAR7      (0x00000080UL)

/* DMA Interrupt Error Status Register */
typedef struct{
__REG32 INTERRSTAT0 : 1;
__REG32 INTERRSTAT1 : 1;
__REG32 INTERRSTAT2 : 1;
__REG32 INTERRSTAT3 : 1;
__REG32 INTERRSTAT4 : 1;
__REG32 INTERRSTAT5 : 1;
__REG32 INTERRSTAT6 : 1;
__REG32 INTERRSTAT7 : 1;
__REG32             :24;
} __dmacinterrstat_bits;

/* DMA Interrupt Error Clear Register */

#define GPDMA_INTERRCLR_INTERRCLR       (0x000000FFUL)
#define GPDMA_INTERRCLR_INTERRCLR0      (0x00000001UL)
#define GPDMA_INTERRCLR_INTERRCLR1      (0x00000002UL)
#define GPDMA_INTERRCLR_INTERRCLR2      (0x00000004UL)
#define GPDMA_INTERRCLR_INTERRCLR3      (0x00000008UL)
#define GPDMA_INTERRCLR_INTERRCLR4      (0x00000010UL)
#define GPDMA_INTERRCLR_INTERRCLR5      (0x00000020UL)
#define GPDMA_INTERRCLR_INTERRCLR6      (0x00000040UL)
#define GPDMA_INTERRCLR_INTERRCLR7      (0x00000080UL)

/* DMA Raw Interrupt Terminal Count Status Register */
typedef struct{
__REG32 RAWINTTCSTAT0 : 1;
__REG32 RAWINTTCSTAT1 : 1;
__REG32 RAWINTTCSTAT2 : 1;
__REG32 RAWINTTCSTAT3 : 1;
__REG32 RAWINTTCSTAT4 : 1;
__REG32 RAWINTTCSTAT5 : 1;
__REG32 RAWINTTCSTAT6 : 1;
__REG32 RAWINTTCSTAT7 : 1;
__REG32                 :24;
} __dmacrawinttcstatus_bits;

/* DMA Raw Error Interrupt Status Register */
typedef struct{
__REG32 RAWINTERRSTAT0  : 1;
__REG32 RAWINTERRSTAT1  : 1;
__REG32 RAWINTERRSTAT2  : 1;
__REG32 RAWINTERRSTAT3  : 1;
__REG32 RAWINTERRSTAT4  : 1;
__REG32 RAWINTERRSTAT5  : 1;
__REG32 RAWINTERRSTAT6  : 1;
__REG32 RAWINTERRSTAT7  : 1;
__REG32                 :24;
} __dmacrawinterrorstatus_bits;

/* DMA Enabled Channel Register */
typedef struct{
__REG32 ENABLEDCHANNELS0  : 1;
__REG32 ENABLEDCHANNELS1  : 1;
__REG32 ENABLEDCHANNELS2  : 1;
__REG32 ENABLEDCHANNELS3  : 1;
__REG32 ENABLEDCHANNELS4  : 1;
__REG32 ENABLEDCHANNELS5  : 1;
__REG32 ENABLEDCHANNELS6  : 1;
__REG32 ENABLEDCHANNELS7  : 1;
__REG32                   :24;
} __dmacenbldchns_bits;

/* DMA Software Burst Request Register */
typedef struct{
__REG32 SOFTBREQ0         : 1;
__REG32 SOFTBREQ1         : 1;
__REG32 SOFTBREQ2         : 1;
__REG32 SOFTBREQ3         : 1;
__REG32 SOFTBREQ4         : 1;
__REG32 SOFTBREQ5         : 1;
__REG32 SOFTBREQ6         : 1;
__REG32 SOFTBREQ7         : 1;
__REG32 SOFTBREQ8         : 1;
__REG32 SOFTBREQ9         : 1;
__REG32 SOFTBREQ10        : 1;
__REG32 SOFTBREQ11        : 1;
__REG32 SOFTBREQ12        : 1;
__REG32 SOFTBREQ13        : 1;
__REG32 SOFTBREQ14        : 1;
__REG32 SOFTBREQ15        : 1;
__REG32                   :16;
} __dmacsoftbreq_bits;

/* DMA Software Single Request Register */
typedef struct{
__REG32 SOFTSREQ0         : 1;
__REG32 SOFTSREQ1         : 1;
__REG32 SOFTSREQ2         : 1;
__REG32 SOFTSREQ3         : 1;
__REG32 SOFTSREQ4         : 1;
__REG32 SOFTSREQ5         : 1;
__REG32 SOFTSREQ6         : 1;
__REG32 SOFTSREQ7         : 1;
__REG32 SOFTSREQ8         : 1;
__REG32 SOFTSREQ9         : 1;
__REG32 SOFTSREQ10        : 1;
__REG32 SOFTSREQ11        : 1;
__REG32 SOFTSREQ12        : 1;
__REG32 SOFTSREQ13        : 1;
__REG32 SOFTSREQ14        : 1;
__REG32 SOFTSREQ15        : 1;
__REG32                   :16;
} __dmacsoftsreq_bits;

/* DMA Software Last Burst Request Register */
typedef struct{
__REG32 SOFTLBREQ0         : 1;
__REG32 SOFTLBREQ1         : 1;
__REG32 SOFTLBREQ2         : 1;
__REG32 SOFTLBREQ3         : 1;
__REG32 SOFTLBREQ4         : 1;
__REG32 SOFTLBREQ5         : 1;
__REG32 SOFTLBREQ6         : 1;
__REG32 SOFTLBREQ7         : 1;
__REG32 SOFTLBREQ8         : 1;
__REG32 SOFTLBREQ9         : 1;
__REG32 SOFTLBREQ10        : 1;
__REG32 SOFTLBREQ11        : 1;
__REG32 SOFTLBREQ12        : 1;
__REG32 SOFTLBREQ13        : 1;
__REG32 SOFTLBREQ14        : 1;
__REG32 SOFTLBREQ15        : 1;
__REG32                    :16;
} __dmacsoftlbreq_bits;

/* DMA Software Last Single Request Register */
typedef struct{
__REG32 SOFTLSREQ0          : 1;
__REG32 SOFTLSREQ1          : 1;
__REG32 SOFTLSREQ2          : 1;
__REG32 SOFTLSREQ3          : 1;
__REG32 SOFTLSREQ4          : 1;
__REG32 SOFTLSREQ5          : 1;
__REG32 SOFTLSREQ6          : 1;
__REG32 SOFTLSREQ7          : 1;
__REG32 SOFTLSREQ8          : 1;
__REG32 SOFTLSREQ9          : 1;
__REG32 SOFTLSREQ10         : 1;
__REG32 SOFTLSREQ11         : 1;
__REG32 SOFTLSREQ12         : 1;
__REG32 SOFTLSREQ13         : 1;
__REG32 SOFTLSREQ14         : 1;
__REG32 SOFTLSREQ15         : 1;
__REG32                     :16;
} __dmacsoftlsreq_bits;

/* DMA Synchronization Register */
typedef struct{
__REG32 DMACSYNC0   : 1;
__REG32 DMACSYNC1   : 1;
__REG32 DMACSYNC2   : 1;
__REG32 DMACSYNC3   : 1;
__REG32 DMACSYNC4   : 1;
__REG32 DMACSYNC5   : 1;
__REG32 DMACSYNC6   : 1;
__REG32 DMACSYNC7   : 1;
__REG32 DMACSYNC8   : 1;
__REG32 DMACSYNC9   : 1;
__REG32 DMACSYNC10  : 1;
__REG32 DMACSYNC11  : 1;
__REG32 DMACSYNC12  : 1;
__REG32 DMACSYNC13  : 1;
__REG32 DMACSYNC14  : 1;
__REG32 DMACSYNC15  : 1;
__REG32             :16;
} __dmacsync_bits;

/* DMA Configuration Register */
typedef struct{
__REG32 E   : 1;
__REG32 M0  : 1;
__REG32 M1  : 1;
__REG32     :29;
} __dmacconfig_bits;

/* DMA Channel Linked List Item registers */
typedef struct{
__REG32 LM  : 1;
__REG32     : 1;
__REG32 LLI :30;
} __dma_lli_bits;

