una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
/* DMA Operation mode register */
typedef struct{
__REG32                 : 1;
__REG32 SR              : 1;
__REG32 OSF             : 1;
__REG32 RTC             : 2;
__REG32                 : 1;
__REG32 FUF             : 1;
__REG32 FEF             : 1;
__REG32                 : 5;
__REG32 ST              : 1;
__REG32 TTC             : 3;
__REG32                 : 3;
__REG32 FTF             : 1;
__REG32 TSF             : 1;
__REG32                 : 2;
__REG32 DFF             : 1;
__REG32 RSF             : 1;
__REG32 DT              : 1;
__REG32                 : 5;
} __eth_dma_op_mode_bits;

/* DMA Interrupt enable register */
typedef struct{
__REG32 TIE             : 1;
__REG32 TSE             : 1;
__REG32 TUE             : 1;
__REG32 TJE             : 1;
__REG32 OVE             : 1;
__REG32 UNE             : 1;
__REG32 RIE             : 1;
__REG32 RUE             : 1;
__REG32 RSE             : 1;
__REG32 RWE             : 1;
__REG32 ETE             : 1;
__REG32                 : 2;
__REG32 FBE             : 1;
__REG32 ERE             : 1;
__REG32 AIE             : 1;
__REG32 NIE             : 1;
__REG32                 :15;
} __eth_dma_int_en_bits;

/* DMA Missed frame and buffer overflow counter register */
typedef struct{
__REG32 FMC             :16;
__REG32 OC              : 1;
__REG32 FMA             :11;
__REG32 OF              : 1;
__REG32                 : 3;
} __eth_dma_mfrm_bufof_bits;

/* DMA Receive interrupt watchdog timer register */
typedef struct{
__REG32 RIWT            : 8;
__REG32                 :24;
} __eth_dma_rec_int_wdt_bits;


/* SCT configuration register */
typedef struct{
__REG32 UNIFY                 : 1;
__REG32 CLKMODE               : 2;
__REG32 CLKSEL                : 4;
__REG32 NORELAODL_NORELOADU   : 1;
__REG32 NORELOADH             : 1;
__REG32 INSYNC0               : 1;
__REG32 INSYNC1               : 1;
__REG32 INSYNC2               : 1;
__REG32 INSYNC3               : 1;
__REG32 INSYNC4               : 1;
__REG32 INSYNC5               : 1;
__REG32 INSYNC6               : 1;
__REG32 INSYNC7               : 1;
__REG32                       :15;
} __sct_config_bits;

/* SCT control register */
typedef union{
  /* SCT_CTRL */
  struct{
  __REG32 DOWN_L                : 1;
  __REG32 STOP_L                : 1;
  __REG32 HALT_L                : 1;
  __REG32 CLRCTR_L              : 1;
  __REG32 BIDIR_L               : 1;
  __REG32 PRE_L                 : 8;
  __REG32                       : 3;
  __REG32 DOWN_H                : 1;
  __REG32 STOP_H                : 1;
  __REG32 HALT_H                : 1;
  __REG32 CLRCTR_H              : 1;
  __REG32 BIDIR_H               : 1;
  __REG32 PRE_H                 : 8;
  __REG32                       : 3;
  };

  struct{
    union{
      /* SCT_CTRL_L */
      struct{
      __REG16 DOWN_L                : 1;
      __REG16 STOP_L                : 1;
      __REG16 HALT_L                : 1;
      __REG16 CLRCTR_L              : 1;
      __REG16 BIDIR_L               : 1;
      __REG16 PRE_L                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_l_bits;
      __REG16 __sct_ctrl_l;
    };
    union{
      /* SCT_CTRL_H */
      struct{
      __REG16 DOWN_H                : 1;
      __REG16 STOP_H                : 1;
      __REG16 HALT_H                : 1;
      __REG16 CLRCTR_H              : 1;
      __REG16 BIDIR_H               : 1;
      __REG16 PRE_H                 : 8;
      __REG16                       : 3;
      } __sct_ctrl_h_bits;
      __REG16 __sct_ctrl_h;
    };
  };
} __sct_ctrl_bits;


/* SCT limit register */
typedef union{
  /* SCT_LIMIT */
  struct{
  __REG32 LIMMSK0_L             : 1;
  __REG32 LIMMSK1_L             : 1;
  __REG32 LIMMSK2_L             : 1;
  __REG32 LIMMSK3_L             : 1;
  __REG32 LIMMSK4_L             : 1;
  __REG32 LIMMSK5_L             : 1;
  __REG32 LIMMSK6_L             : 1;
  __REG32 LIMMSK7_L             : 1;
  __REG32 LIMMSK8_L             : 1;
  __REG32 LIMMSK9_L             : 1;
  __REG32 LIMMSK10_L            : 1;
  __REG32 LIMMSK11_L            : 1;
  __REG32 LIMMSK12_L            : 1;
  __REG32 LIMMSK13_L            : 1;
  __REG32 LIMMSK14_L            : 1;
  __REG32 LIMMSK15_L            : 1;
  __REG32 LIMMSK0_H             : 1;
  __REG32 LIMMSK1_H             : 1;
  __REG32 LIMMSK2_H             : 1;
  __REG32 LIMMSK3_H             : 1;
  __REG32 LIMMSK4_H             : 1;
  __REG32 LIMMSK5_H             : 1;
  __REG32 LIMMSK6_H             : 1;
  __REG32 LIMMSK7_H             : 1;
  __REG32 LIMMSK8_H             : 1;
  __REG32 LIMMSK9_H             : 1;
  __REG32 LIMMSK10_H            : 1;
  __REG32 LIMMSK11_H            : 1;
  __REG32 LIMMSK12_H            : 1;
  __REG32 LIMMSK13_H            : 1;
  __REG32 LIMMSK14_H            : 1;
  __REG32 LIMMSK15_H            : 1;
  };

  struct{
    union{
      /* SCT_LIMIT_L */
      struct{
      __REG16 LIMMSK0_L             : 1;
      __REG16 LIMMSK1_L             : 1;
      __REG16 LIMMSK2_L             : 1;
      __REG16 LIMMSK3_L             : 1;
      __REG16 LIMMSK4_L             : 1;
      __REG16 LIMMSK5_L             : 1;
      __REG16 LIMMSK6_L             : 1;
      __REG16 LIMMSK7_L             : 1;
      __REG16 LIMMSK8_L             : 1;
      __REG16 LIMMSK9_L             : 1;
      __REG16 LIMMSK10_L            : 1;
      __REG16 LIMMSK11_L            : 1;
      __REG16 LIMMSK12_L            : 1;
      __REG16 LIMMSK13_L            : 1;
      __REG16 LIMMSK14_L            : 1;
      __REG16 LIMMSK15_L            : 1;
      } __sct_limit_l_bits;
      __REG16 __sct_limit_l;
    };
    union{
      /* SCT_LIMIT_H */
      struct{
      __REG16 LIMMSK0_H             : 1;
      __REG16 LIMMSK1_H             : 1;
      __REG16 LIMMSK2_H             : 1;
      __REG16 LIMMSK3_H             : 1;
      __REG16 LIMMSK4_H             : 1;
      __REG16 LIMMSK5_H             : 1;
      __REG16 LIMMSK6_H             : 1;
      __REG16 LIMMSK7_H             : 1;
      __REG16 LIMMSK8_H             : 1;
      __REG16 LIMMSK9_H             : 1;
      __REG16 LIMMSK10_H            : 1;
      __REG16 LIMMSK11_H            : 1;
      __REG16 LIMMSK12_H            : 1;
      __REG16 LIMMSK13_H            : 1;
      __REG16 LIMMSK14_H            : 1;
      __REG16 LIMMSK15_H            : 1;
      } __sct_limit_h_bits;
      __REG16 __sct_limit_h;
    };
  };
} __sct_limit_bits;

