una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
/* RTC consolidated time register 0 */
typedef struct{
__REG32 SECONDS : 6;
__REG32         : 2;
__REG32 MINUTES : 6;
__REG32         : 2;
__REG32 HOURS   : 5;
__REG32         : 3;
__REG32 DOW     : 3;
__REG32         : 5;
} __rtc_ctime0_bits;

/* RTC consolidated time register 1 */
typedef struct{
__REG32 DOM   : 5;
__REG32       : 3;
__REG32 MONTH : 4;
__REG32       : 4;
__REG32 YEAR  :12;
__REG32       : 4;
} __rtc_ctime1_bits;

/* RTC consolidated time register 2 */
typedef struct{
__REG32 DOY  :12;
__REG32      :20;
} __rtc_ctime2_bits;

/* RTC second register */
typedef struct{
__REG32 SECONDS : 6;
__REG32         :26;
} __rtc_sec_bits;

/* RTC minute register */
typedef struct{
__REG32 MINUTES : 6;
__REG32         :26;
} __rtc_min_bits;

/* RTC hour register */
typedef struct{
__REG32 HOURS : 5;
__REG32       :27;
} __rtc_hour_bits;

/* RTC day of month register */
typedef struct{
__REG32 DOM  : 5;
__REG32      :27;
} __rtc_dom_bits;

/* RTC day of week register */
typedef struct{
__REG32 DOW  : 3;
__REG32      :29;
} __rtc_dow_bits;

/* RTC day of year register */
typedef struct{
__REG32 DOY  : 9;
__REG32      :23;
} __rtc_doy_bits;

/* RTC month register */
typedef struct{
__REG32 MONTH : 4;
__REG32       :28;
} __rtc_month_bits;

/* RTC year register */
typedef struct{
__REG32 YEAR :12;
__REG32      :20;
} __rtc_year_bits;


/* UART Receive Buffer Register (RBR) */
/* UART Transmit Holding Register (THR) */
/* UART Divisor Latch Register  Low (DLL) */
typedef union {
  /*UxRBR*/
  struct {
    __REG32 RBR           : 8;
    __REG32               :24;
  };
  /*UxTHR*/
  struct {
    __REG32 THR           : 8;
    __REG32               :24;
  };
  /*UxDLL*/
  struct {
    __REG32 DLLSB         : 8;
    __REG32               :24;
  };
} __uart_rbr_bits;

/* UART interrupt enable register */
typedef union {
  /*UxIER*/
  struct{
    __REG32 RBRIE     : 1;
    __REG32 THREIE    : 1;
    __REG32 RXIE      : 1;
    __REG32           : 5;
    __REG32 ABEOINTEN : 1;
    __REG32 ABTOINTEN : 1;
    __REG32           :22;
  };
  /*UxDLM*/
  struct {
    __REG32 DLMSB         : 8;
    __REG32               :24;
  };
} __uart_ier_bits;

//* UART interrupt enable register */
typedef union {
  /*U1IER*/
  struct{
    __REG32 RBRIE     : 1;
    __REG32 THREIE    : 1;
    __REG32 RXIE      : 1;
    __REG32 MSIE      : 1;
    __REG32           : 3;
    __REG32 CTSIE     : 1;
    __REG32 ABEOIE    : 1;
    __REG32 ABTOIE    : 1;
    __REG32           :22;
  };
  /*U1DLM*/
  struct {
    __REG32 DLMSB         : 8;
    __REG32               :24;
  };
} __uart1_ier_bits;


/* UART Transmit Enable Register */
typedef struct{
  __REG32 TXEN            : 1;
  __REG32                 :31;
} __uart_ter_bits;

/* UART Scratch Pad Register */
typedef struct{
  __REG32 PAD             : 8;
  __REG32                 :24;
} __uart_scr_bits;

/* UART1 Scratch Pad Register */
typedef struct{
  __REG32 Pad             : 8;
  __REG32                 :24;
} __uart1_scr_bits;

/* UART1 Transmit Enable Register */
typedef struct{
  __REG32                 : 7;
  __REG32 TXEN            : 1;
  __REG32                 :24;
} __uart1_ter_bits;

/* UART Line Status Register (LSR) */
typedef struct {
__REG32 RDR             : 1;
__REG32 OE              : 1;
__REG32 PE              : 1;
__REG32 FE              : 1;
__REG32 BI              : 1;
__REG32 THRE            : 1;
__REG32 TEMT            : 1;
__REG32 RXFE            : 1;
__REG32 TXERR           : 1;
__REG32                 :23;
} __uart_lsr_bits;

/* UART1 Line Status Register (LSR) */
typedef struct {
__REG32 RDR             : 1;
__REG32 OE              : 1;
__REG32 PE              : 1;
__REG32 FE              : 1;
__REG32 BI              : 1;
__REG32 THRE            : 1;
__REG32 TEMT            : 1;
__REG32 RXFE            : 1;
__REG32                 :24;
} __uart1_lsr_bits;

/* UART Line Control Register (LCR) */
typedef struct {
__REG32 WLS   : 2;
__REG32 SBS   : 1;
__REG32 PE    : 1;
__REG32 PS    : 2;
__REG32 BC    : 1;
__REG32 DLAB  : 1;
__REG32       :24;
} __uart_lcr_bits;

/* UART interrupt identification register and fifo control register */
typedef union {
  /*UxIIR*/
  struct {
__REG32 INTSTATUS : 1;
__REG32 INTID     : 3;
__REG32           : 2;
__REG32 FIFOENABLE: 2;
__REG32 ABEOINT   : 1;
__REG32 ABTOINT   : 1;
__REG32           :22;
  };
  /*UxFCR*/
  struct {
__REG32 FIFOEN      : 1;
__REG32 RXFIFORES   : 1;
__REG32 TXFIFORES   : 1;
__REG32 DMAMODE     : 1;
__REG32             : 2;
__REG32 RXTRIGLVL   : 2;
__REG32             :24;
  };
} __uart_fcriir_bits;

/* UART modem control register */
typedef struct{
__REG32 DTRCTRL : 1;
__REG32 RTSCTRL : 1;
__REG32         : 2;
__REG32 LMS     : 1;
__REG32         : 1;
__REG32 RTSEN   : 1;
__REG32 CTSEN   : 1;
__REG32         :24;
} __uart1_mcr_bits;

/* UART modem status register */
typedef struct{
__REG32 DCTS  : 1;
__REG32 DDSR  : 1;
__REG32 TERI  : 1;
__REG32 DDCD  : 1;
__REG32 CTS   : 1;
__REG32 DSR   : 1;
__REG32 RI    : 1;
__REG32 DCD   : 1;
__REG32       :24;
} __uart1_msr_bits;

/* UART Auto-baud Control Register */
typedef struct{
__REG32 START        : 1;
__REG32 MODE         : 1;
__REG32 AUTORESTART  : 1;
__REG32              : 5;
__REG32 ABEOINTCLR   : 1;
__REG32 ABTOINTCLR   : 1;
__REG32              :22;
} __uart_acr_bits;

/* IrDA Control Register */
typedef struct{
__REG32 IRDAEN       : 1;
__REG32 IRDAINV      : 1;
__REG32 FIXPULSEEN   : 1;
__REG32 PULSEDIV     : 3;
__REG32              :26;
} __uart_icr_bits;

/* UART Fractional Divider Register */
typedef struct{
__REG32 DIVADDVAL  : 4;
__REG32 MULVAL     : 4;
__REG32            :24;
} __uart_fdr_bits;

/* UART Oversampling Register */
typedef struct{
__REG32            : 1;
__REG32 OSFRAC     : 3;
__REG32 OSINT      : 4;
__REG32 FDINT      : 7;
__REG32            :17;
} __uart_osr_bits;

