una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
/* I2S Digital Audio Input Register */
typedef struct{
__REG32 WORDWIDTH     : 2;
__REG32 MONO          : 1;
__REG32 STOP          : 1;
__REG32 RESET         : 1;
__REG32 WS_SEL        : 1;
__REG32 WS_HALFPERIOD : 9;
__REG32               :17;
} __i2s_dai_bits;

/* I2S Status Feedback Register */
typedef struct{
__REG32 IRQ           : 1;
__REG32 DMAREQ1       : 1;
__REG32 DMAREQ2       : 1;
__REG32               : 5;
__REG32 RX_LEVEL      : 4;
__REG32               : 4;
__REG32 TX_LEVEL      : 4;
__REG32               :12;
} __i2s_state_bits;

/* I2S DMA1 Configuration Register */
typedef struct{
__REG32 RX_DMA1_ENABLE : 1;
__REG32 TX_DMA1_ENABLE : 1;
__REG32                : 6;
__REG32 RX_DEPTH_DMA1  : 4;
__REG32                : 4;
__REG32 TX_DEPTH_DMA1  : 4;
__REG32                :12;
} __i2s_dma1_bits;

/* I2S DMA2 Configuration Register */
typedef struct{
__REG32 RX_DMA2_ENABLE : 1;
__REG32 TX_DMA2_ENABLE : 1;
__REG32                : 6;
__REG32 RX_DEPTH_DMA2  : 4;
__REG32                : 4;
__REG32 TX_DEPTH_DMA2  : 4;
__REG32                :12;
} __i2s_dma2_bits;

/* I2S Interrupt Request Control register */
typedef struct{
__REG32 RX_IRQ_ENABLE : 1;
__REG32 TX_IRQ_ENABLE : 1;
__REG32               : 6;
__REG32 RX_DEPTH_IRQ  : 4;
__REG32               : 4;
__REG32 TX_DEPTH_IRQ  : 4;
__REG32               :12;
} __i2s_irq_bits;

/* I2S Receive & Transmit Clock Rate Registers */
typedef struct{
__REG32 Y_DIVIDER     : 8;
__REG32 X_DIVIDER     : 8;
__REG32               :16;
} __i2s_rxtxrate_bits;

/* Transmit Clock Rate register */
typedef struct{
__REG32 TX_BITRATE    : 6;
__REG32               :26;
} __i2s_txbitrate_bits;

/* Receive Clock Rate register */
typedef struct{
__REG32 RX_BITRATE    : 6;
__REG32               :26;
} __i2s_rxbitrate_bits;

/* Transmit Mode Control register */
typedef struct{
__REG32 TXCLKSEL      : 2;
__REG32 TX4PIN        : 1;
__REG32 TXMCENA       : 1;
__REG32               :28;
} __i2s_txmode_bits;

/* Receive Mode Control register */
typedef struct{
__REG32 RXCLKSEL      : 2;
__REG32 RX4PIN        : 1;
__REG32 RXMCENA       : 1;
__REG32               :28;
} __i2s_rxmode_bits;


/* I2C control set register */
typedef struct{
__REG32       : 2;
__REG32 AA    : 1;
__REG32 SI    : 1;
__REG32 STO   : 1;
__REG32 STA   : 1;
__REG32 I2EN  : 1;
__REG32       :25;
} __i2c_conset_bits;

/* I2C control clear register */

#define I2C_CONCLR_AAC      (0x00000004UL)
#define I2C_CONCLR_SIC      (0x00000008UL)
#define I2C_CONCLR_STAC     (0x00000020UL)
#define I2C_CONCLR_I2ENC    (0x00000040UL)

/* I2C status register */
typedef struct{
__REG32         : 3;
__REG32 Status  : 5;
__REG32         :24;
} __i2c_stat_bits;

/* I2C data register */
typedef struct{
__REG32 Data  : 8;
__REG32       :24;
} __i2c_dat_bits;

/* I2C Monitor mode control register */
typedef struct{
__REG32 MM_ENA    : 1;
__REG32 ENA_SCL   : 1;
__REG32 MATCH_ALL : 1;
__REG32           :29;
} __i2c_mmctrl_bits;

/* I2C slave  register */
typedef struct{
__REG32 GC      : 1;
__REG32 Address : 7;
__REG32         :24;
} __i2c_adr_bits;

/* I2C Mask registers */
typedef struct{
__REG32       : 1;
__REG32 MASK  : 7;
__REG32       :24;
} __i2c_mask_bits;

/* I2C SCL High Duty Cycle register */
typedef struct{
__REG32 SCLH   :16;
__REG32        :16;
} __i2c_sclh_bits;

/* I2C scl duty cycle register */
typedef struct{
__REG32 SCLL   :16;
__REG32        :16;
} __i2c_scll_bits;


/* A/D Control Register */
typedef struct{
__REG32 SEL     : 8;
__REG32 CLKDIV  : 8;
__REG32 BURST   : 1;
__REG32 CLKS    : 3;
__REG32         : 1;
__REG32 PDN     : 1;
__REG32         : 2;
__REG32 START   : 3;
__REG32 EDGE    : 1;
__REG32         : 4;
} __adc_cr_bits;

/* A/D Global Data Register */
typedef struct{
__REG32         : 6;
__REG32 V_VREF  :10;
__REG32         : 8;
__REG32 CHN     : 3;
__REG32         : 3;
__REG32 OVERUN  : 1;
__REG32 DONE    : 1;
} __adc_gdr_bits;

/* A/D Status Register */
typedef struct{
__REG32 DONE0     : 1;
__REG32 DONE1     : 1;
__REG32 DONE2     : 1;
__REG32 DONE3     : 1;
__REG32 DONE4     : 1;
__REG32 DONE5     : 1;
__REG32 DONE6     : 1;
__REG32 DONE7     : 1;
__REG32 OVERUN0  : 1;
__REG32 OVERUN1  : 1;
__REG32 OVERUN2  : 1;
__REG32 OVERUN3  : 1;
__REG32 OVERUN4  : 1;
__REG32 OVERUN5  : 1;
__REG32 OVERUN6  : 1;
__REG32 OVERUN7  : 1;
__REG32 ADINT     : 1;
__REG32           :15;
} __adc_stat_bits;

/* A/D Intrrupt Enable Register */
typedef struct{
__REG32 ADINTEN0  : 1;
__REG32 ADINTEN1  : 1;
__REG32 ADINTEN2  : 1;
__REG32 ADINTEN3  : 1;
__REG32 ADINTEN4  : 1;
__REG32 ADINTEN5  : 1;
__REG32 ADINTEN6  : 1;
__REG32 ADINTEN7  : 1;
__REG32 ADGINTEN  : 1;
__REG32           :23;
} __adc_inten_bits;

/* A/D Data Register */
typedef struct{
__REG32         : 6;
__REG32 V_VREF  :10;
__REG32         :14;
__REG32 OVERUN  : 1;
__REG32 DONE    : 1;
} __adc_dr_bits;


/* D/A Converter Register */
typedef struct{
__REG32        : 6;
__REG32 VALUE  :10;
__REG32 BIAS   : 1;
__REG32        :15;
} __dac_cr_bits;

/* D/A Converter Control register */
typedef struct{
__REG32 INT_DMA_REQ : 1;
__REG32 DBLBUF_ENA  : 1;
__REG32 CNT_ENA     : 1;
__REG32 DMA_ENA     : 1;
__REG32             :28;
} __dac_ctrl_bits;

/* D/A Converter Counter Value register */
typedef struct{
__REG32 VALUE       :16;
__REG32             :16;
} __dac_cntval_bits;


/* SPI control register */
typedef struct{
__REG32           : 2;
__REG32 BITENABLE : 1;
__REG32 CPHA      : 1;
__REG32 CPOL      : 1;
__REG32 MSTR      : 1;
__REG32 LSBF      : 1;
__REG32 SPIE      : 1;
__REG32 BITS      : 4;
__REG32           :20;
} __spi_cr_bits;

/* SPI status register */
typedef struct{
__REG32         : 3;
__REG32 ABRT    : 1;
__REG32 MODF    : 1;
__REG32 ROVR    : 1;
__REG32 WCOL    : 1;
__REG32 SPIF    : 1;
__REG32         :24;
} __spi_sr_bits;

