una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
__IO_REG32_BIT(CPACR,                 0xE000ED88,__READ_WRITE ,__cpacr_bits);

__IO_REG32_BIT(DHCSR,                 0xE000EDF0,__READ_WRITE ,__dhcsr_bits);
#define DHCSR_READ       DHCSR
#define DHCSR_READ_bit   DHCSR_bit
#define DHCSR_WRITE      DHCSR
#define DHCSR_WRITE_bit  DHCSR_bit.__dhcsr_write_bits

__IO_REG32(    DCRSR,                 0xE000EDF4,__WRITE      );
__IO_REG32(    DCRDR,                 0xE000EDF8,__READ_WRITE );
__IO_REG32_BIT(DEMCR,                 0xE000EDFC,__READ_WRITE ,__demcr_bits);

__IO_REG32(    STIR,                  0xE000EF00,__WRITE      );

__IO_REG32_BIT(FPCCR,                 0xE000EF34,__READ_WRITE ,__fpccr_bits);
__IO_REG32_BIT(FPCAR,                 0xE000EF38,__READ_WRITE ,__fpcar_bits);
__IO_REG32_BIT(FPDSCR,                0xE000EF3C,__READ_WRITE ,__fpdscr_bits);
__IO_REG32_BIT(MVFR0,                 0xE000EF40,__READ_WRITE ,__mvfr0_bits);
__IO_REG32_BIT(MVFR1,                 0xE000EF44,__READ_WRITE ,__mvfr1_bits);

__IO_REG32(    PID4,                  0xE000EFD0,__READ       );
__IO_REG32(    PID5,                  0xE000EFD4,__READ       );
__IO_REG32(    PID6,                  0xE000EFD8,__READ       );
__IO_REG32(    PID7,                  0xE000EFDC,__READ       );
__IO_REG32(    PID0,                  0xE000EFE0,__READ       );
__IO_REG32(    PID1,                  0xE000EFE4,__READ       );
__IO_REG32(    PID2,                  0xE000EFE8,__READ       );
__IO_REG32(    PID3,                  0xE000EFEC,__READ       );

__IO_REG32(    CID0,                  0xE000EFF0,__READ       );
__IO_REG32(    CID1,                  0xE000EFF4,__READ       );
__IO_REG32(    CID2,                  0xE000EFF8,__READ       );
__IO_REG32(    CID3,                  0xE000EFFC,__READ       );

/***************************************************************************
 **
 ** MPU
 **
 ***************************************************************************/
__IO_REG32_BIT(MPU_TYPE,              0xE000ED90,__READ       ,__mpu_type_bits);
__IO_REG32_BIT(MPU_CTRL,              0xE000ED94,__READ_WRITE ,__mpu_ctrl_bits);
__IO_REG32_BIT(MPU_RNR,               0xE000ED98,__READ_WRITE ,__mpu_rnr_bits);
__IO_REG32_BIT(MPU_RBAR,              0xE000ED9C,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR,              0xE000EDA0,__READ_WRITE ,__mpu_rasr_bits);
__IO_REG32_BIT(MPU_RBAR_A1,           0xE000EDA4,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR_A1,           0xE000EDA8,__READ_WRITE ,__mpu_rasr_bits);
__IO_REG32_BIT(MPU_RBAR_A2,           0xE000EDAC,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR_A2,           0xE000EDB0,__READ_WRITE ,__mpu_rasr_bits);
__IO_REG32_BIT(MPU_RBAR_A3,           0xE000EDB4,__READ_WRITE ,__mpu_rbar_bits);
__IO_REG32_BIT(MPU_RASR_A3,           0xE000EDB8,__READ_WRITE ,__mpu_rasr_bits);

/***************************************************************************
 **
 ** OTP
 **
 ***************************************************************************/
__IO_REG32(    OTP_B0W0,              0x40045000,__READ_WRITE );
__IO_REG32(    OTP_B0W1,              0x40045004,__READ_WRITE );
__IO_REG32(    OTP_B0W2,              0x40045008,__READ_WRITE );
__IO_REG32(    OTP_B0W3,              0x4004500C,__READ_WRITE );
__IO_REG32(    OTP_B1W0,              0x40045010,__READ_WRITE );
__IO_REG32(    OTP_B1W1,              0x40045014,__READ_WRITE );
__IO_REG32(    OTP_B1W2,              0x40045018,__READ_WRITE );
__IO_REG32(    OTP_B1W3,              0x4004501C,__READ_WRITE );
__IO_REG32(    OTP_B2W0,              0x40045020,__READ_WRITE );
__IO_REG32(    OTP_B2W1,              0x40045024,__READ_WRITE );
__IO_REG32(    OTP_B2W2,              0x40045028,__READ_WRITE );
__IO_REG32(    OTP_B2W3,              0x4004502C,__READ_WRITE );
__IO_REG32_BIT(OTP_B3W0,              0x40045030,__READ_WRITE ,__otp_b3_w0_bits);
__IO_REG32_BIT(OTP_B3W1,              0x40045034,__READ_WRITE ,__otp_b3_w1_bits);
__IO_REG32_BIT(OTP_B3W2,              0x40045038,__READ_WRITE ,__otp_b3_w2_bits);
__IO_REG32(    OTP_B3W3,              0x4004503C,__READ_WRITE );

/***************************************************************************
 **
 ** ER (Event router)
 **
 ***************************************************************************/
__IO_REG32_BIT(ER_HILO,               0x40044000,__READ_WRITE ,__er_hilo_bits);
__IO_REG32_BIT(ER_EDGE,               0x40044004,__READ_WRITE ,__er_edge_bits);
__IO_REG32(    ER_CLR_EN,             0x40044FD8,__WRITE      );
__IO_REG32(    ER_SET_EN,             0x40044FDC,__WRITE      );
__IO_REG32_BIT(ER_STATUS,             0x40044FE0,__READ       ,__er_status_bits);
__IO_REG32_BIT(ER_ENABLE,             0x40044FE4,__READ       ,__er_enable_bits);
__IO_REG32(    ER_CLR_STAT,           0x40044FE8,__WRITE      );
__IO_REG32(    ER_SET_STAT,           0x40044FEC,__WRITE      );

/***************************************************************************
 **
 ** CREG (Configuration registers)
 **
 ***************************************************************************/
__IO_REG32_BIT(CREG_CREG0,            0x40043004,__READ_WRITE ,__creg_creg0_bits);
/*__IO_REG32_BIT(CREG_PMUCON,           0x40043008,__READ_WRITE ,__creg_pmucon_bits);*/
__IO_REG32_BIT(CREG_M4MEMMAP,         0x40043100,__READ_WRITE ,__creg_m4memmap_bits);
__IO_REG32(    CREG_CREG1,            0x40043108,__READ       );
__IO_REG32(    CREG_CREG2,            0x4004310C,__READ       );
__IO_REG32(    CREG_CREG3,            0x40043110,__READ       );
__IO_REG32(    CREG_CREG4,            0x40043114,__READ       );
__IO_REG32_BIT(CREG_CREG5,            0x40043118,__READ_WRITE ,__creg_creg5_bits);
__IO_REG32_BIT(CREG_DMAMUX,           0x4004311C,__READ_WRITE ,__creg_dmamux_bits);
__IO_REG32_BIT(CREG_ETBCFG,           0x40043128,__READ_WRITE ,__creg_etbcfg_bits);
__IO_REG32_BIT(CREG_CREG6,            0x4004312C,__READ_WRITE ,__creg_creg6_bits);
__IO_REG32_BIT(CREG_M4TXEVENT,        0x40043130,__READ_WRITE ,__creg_m4txevent_bits);
__IO_REG32(    CREG_CHIPID,           0x40043200,__READ       );
__IO_REG32_BIT(CREG_M0TXEVENT,        0x40043400,__READ_WRITE ,__creg_m0txevent_bits);
__IO_REG32_BIT(CREG_M0APPMEMMAP,      0x40043404,__READ_WRITE ,__creg_m0appmemmap_bits);

/***************************************************************************
 **
 ** PMC (Power Management Controller)
 **
 ***************************************************************************/
__IO_REG32_BIT(PMC_PD0_SLEEP0_HW_ENA,     0x40042000,__READ_WRITE ,__pmc_pd0_sleep0_hw_ena_bits);
__IO_REG32_BIT(PMC_PD0_SLEEP0_MODE,       0x4004201C,__READ_WRITE ,__pmc_pd0_sleep0_mode_bits);

/***************************************************************************
 **
 ** CGU
 **
 ***************************************************************************/
__IO_REG32_BIT(CGU_FREQ_MON,          0x40050014,__READ_WRITE ,__cgu_freq_mon_bits);
__IO_REG32_BIT(CGU_XTAL_OSC_CTRL,     0x40050018,__READ_WRITE ,__cgu_xtal_osc_ctrl_bits);
__IO_REG32_BIT(CGU_PLL0USB_STAT,      0x4005001C,__READ       ,__cgu_pll0usb_stat_bits);
__IO_REG32_BIT(CGU_PLL0USB_CTRL,      0x40050020,__READ_WRITE ,__cgu_pll0usb_ctrl_bits);
__IO_REG32_BIT(CGU_PLL0USB_MDIV,      0x40050024,__READ_WRITE ,__cgu_pll0usb_mdiv_bits);
__IO_REG32_BIT(CGU_PLL0USB_NP_DIV,    0x40050028,__READ_WRITE ,__cgu_pll0usb_np_div_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_STAT,    0x4005002C,__READ       ,__cgu_pll0audio_stat_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_CTRL,    0x40050030,__READ_WRITE ,__cgu_pll0audio_ctrl_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_MDIV,    0x40050034,__READ_WRITE ,__cgu_pll0audio_mdiv_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_NP_DIV,  0x40050038,__READ_WRITE ,__cgu_pll0audio_np_div_bits);
__IO_REG32_BIT(CGU_PLL0AUDIO_FRAC,    0x4005003C,__READ_WRITE ,__cgu_pll0audio_frac_bits);
__IO_REG32_BIT(CGU_PLL1_STAT,         0x40050040,__READ       ,__cgu_pll1_stat_bits);
__IO_REG32_BIT(CGU_PLL1_CTRL,         0x40050044,__READ_WRITE ,__cgu_pll1_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVA_CTRL,        0x40050048,__READ_WRITE ,__cgu_idiva_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVB_CTRL,        0x4005004C,__READ_WRITE ,__cgu_idivx_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVC_CTRL,        0x40050050,__READ_WRITE ,__cgu_idivx_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVD_CTRL,        0x40050054,__READ_WRITE ,__cgu_idivx_ctrl_bits);
__IO_REG32_BIT(CGU_IDIVE_CTRL,        0x40050058,__READ_WRITE ,__cgu_idive_ctrl_bits);
__IO_REG32_BIT(CGU_BASE_SAFE_CLK,     0x4005005C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_USB0_CLK,     0x40050060,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_PERIPH_CLK,   0x40050064,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_USB1_CLK,     0x40050068,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_M4_CLK,       0x4005006C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SPIFI_CLK,    0x40050070,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SPI_CLK,      0x40050074,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_PHY_RX_CLK,   0x40050078,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_PHY_TX_CLK,   0x4005007C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_APB1_CLK,     0x40050080,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_APB3_CLK,     0x40050084,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_VADC_CLK,     0x4005008C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SDIO_CLK,     0x40050090,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SSP0_CLK,     0x40050094,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_SSP1_CLK,     0x40050098,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART0_CLK,    0x4005009C,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART1_CLK,    0x400500A0,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART2_CLK,    0x400500A4,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_UART3_CLK,    0x400500A8,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_OUT_CLK,      0x400500AC,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32(    CGU_OUTCLK_21_CTRL,    0x400500B0,__READ_WRITE );
__IO_REG32(    CGU_OUTCLK_22_CTRL,    0x400500B4,__READ_WRITE );
__IO_REG32(    CGU_OUTCLK_23_CTRL,    0x400500B8,__READ_WRITE );
__IO_REG32(    CGU_OUTCLK_24_CTRL,    0x400500BC,__READ_WRITE );
__IO_REG32_BIT(CGU_BASE_APLL_CLK,     0x400500C0,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_CGU_OUT0_CLK, 0x400500C4,__READ_WRITE ,__cgu_base_xxx_clk_bits);
__IO_REG32_BIT(CGU_BASE_CGU_OUT1_CLK, 0x400500C8,__READ_WRITE ,__cgu_base_xxx_clk_bits);

/***************************************************************************
 **
 ** CCU1
 **
 ***************************************************************************/
__IO_REG32_BIT(CCU1_PM,                        0x40051000,__READ_WRITE ,__ccu_pm_bits);
__IO_REG32_BIT(CCU1_BASE_STAT,                 0x40051004,__READ       ,__ccu1_base_stat_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_BUS_CFG,          0x40051100,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_BUS_STAT,         0x40051104,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_I2C1_CFG,         0x40051108,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_I2C1_STAT,        0x4005110C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_DAC_CFG,          0x40051110,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_DAC_STAT,         0x40051114,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC0_CFG,         0x40051118,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC0_STAT,        0x4005111C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC1_CFG,         0x40051120,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_ADC1_STAT,        0x40051124,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_CAN0_CFG,         0x40051128,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB3_CAN0_STAT,        0x4005112C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_BUS_CFG,          0x40051200,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_BUS_STAT,         0x40051204,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_MOTOCON_PWM_CFG,  0x40051208,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_MOTOCON_PWM_STAT, 0x4005120C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2C0_CFG,         0x40051210,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2C0_STAT,        0x40051214,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2S_CFG,          0x40051218,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_I2S_STAT,         0x4005121C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_CAN1_CFG,         0x40051220,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_APB1_CAN1_STAT,        0x40051224,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPIFI_CFG,             0x40051300,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPIFI_STAT,            0x40051304,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_BUS_CFG,            0x40051400,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_BUS_STAT,           0x40051404,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SPIFI_CFG,          0x40051408,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SPIFI_STAT,         0x4005140C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_GPIO_CFG,           0x40051410,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_GPIO_STAT,          0x40051414,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_ETHERNET_CFG,       0x40051420,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_ETHERNET_STAT,      0x40051424,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USB0_CFG,           0x40051428,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USB0_STAT,          0x4005142C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMC_CFG,            0x40051430,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMC_STAT,           0x40051434,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SDIO_CFG,           0x40051438,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SDIO_STAT,          0x4005143C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_DMA_CFG,            0x40051440,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_DMA_STAT,           0x40051444,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M4CORE_CFG,         0x40051448,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M4CORE_STAT,        0x4005144C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCT_CFG,            0x40051468,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCT_STAT,           0x4005146C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USB1_CFG,           0x40051470,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USB1_STAT,          0x40051474,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMCDIV_CFG,         0x40051478,__READ_WRITE ,__ccu1_clk_emcdiv_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_EMCDIV_STAT,        0x4005147C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M0APP_CFG,          0x40051490,__READ_WRITE ,__ccu1_clk_emcdiv_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_M0APP_STAT,         0x40051494,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_VADC_CFG,           0x40051498,__READ_WRITE ,__ccu1_clk_emcdiv_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_VADC_STAT,          0x4005149C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_WWDT_CFG,           0x40051500,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_WWDT_STAT,          0x40051504,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART0_CFG,         0x40051508,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART0_STAT,        0x4005150C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_UART1_CFG,          0x40051510,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_UART1_STAT,         0x40051514,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP0_CFG,           0x40051518,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP0_STAT,          0x4005151C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER0_CFG,         0x40051520,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER0_STAT,        0x40051524,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER1_CFG,         0x40051528,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER1_STAT,        0x4005152C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCU_CFG,            0x40051530,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SCU_STAT,           0x40051534,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_CREG_CFG,           0x40051538,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_CREG_STAT,          0x4005153C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_RITIMER_CFG,        0x40051600,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_RITIMER_STAT,       0x40051604,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART2_CFG,         0x40051608,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART2_STAT,        0x4005160C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART3_CFG,         0x40051610,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_USART3_STAT,        0x40051614,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER2_CFG,         0x40051618,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER2_STAT,        0x4005161C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER3_CFG,         0x40051620,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_TIMER3_STAT,        0x40051624,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP1_CFG,           0x40051628,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_SSP1_STAT,          0x4005162C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_QEI_CFG,            0x40051630,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_M4_QEI_STAT,           0x40051634,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_BUS_CFG,        0x40051700,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_BUS_STAT,       0x40051704,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_CORE_CFG,       0x40051710,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_CORE_STAT,      0x40051714,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_SGPIO_CFG,      0x40051718,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_PERIPH_SGPIO_STAT,     0x4005171C,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_USB0_CFG,              0x40051800,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_USB0_STAT,             0x40051804,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_USB1_CFG,              0x40051900,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_USB1_STAT,             0x40051904,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPI_CFG,               0x40051A00,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_SPI_STAT,              0x40051A04,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_VADC_CFG,              0x40051B00,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU1_CLK_VADC_STAT,             0x40051B04,__READ       ,__ccu_clk_cfg_bits);


/***************************************************************************
 **
 ** CCU2
 **
 ***************************************************************************/
__IO_REG32_BIT(CCU2_PM,                       0x40052000,__READ_WRITE ,__ccu_pm_bits);
__IO_REG32_BIT(CCU2_BASE_STAT,                0x40052004,__READ       ,__ccu2_base_stat_bits);
__IO_REG32_BIT(CCU2_CLK_APLL_CFG,             0x40052100,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APLL_STAT,            0x40052104,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART3_CFG,      0x40052200,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART3_STAT,     0x40052204,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART2_CFG,      0x40052300,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART2_STAT,     0x40052304,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_UART1_CFG,       0x40052400,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_UART1_STAT,      0x40052404,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART0_CFG,      0x40052500,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_USART0_STAT,     0x40052504,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP1_CFG,        0x40052600,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP1_STAT,       0x40052604,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP0_CFG,        0x40052700,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_APB2_SSP0_STAT,       0x40052704,__READ       ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_SDIO_CFG,             0x40052800,__READ_WRITE ,__ccu_clk_cfg_bits);
__IO_REG32_BIT(CCU2_CLK_SDIO_STAT,            0x40052804,__READ       ,__ccu_clk_cfg_bits);

