una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
__IO_REG32_BIT(SCU_SFSPF_9,                       0x400867A4,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_10,                      0x400867A8,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSPF_11,                      0x400867AC,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK0,                       0x40086C00,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK1,                       0x40086C04,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK2,                       0x40086C08,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSCLK3,                       0x40086C0C,__READ_WRITE ,__scu_sfspx_normdrv_hispd_bits);
__IO_REG32_BIT(SCU_SFSUSB,                        0x40086C80,__READ_WRITE ,__scu_sfsusb_bits);
__IO_REG32_BIT(SCU_SFSI2C0,                       0x40086C84,__READ_WRITE ,__scu_sfsi2c0_bits);
__IO_REG32_BIT(SCU_ENAIO0,                        0x40086C88,__READ_WRITE ,__scu_enaio0_bits);
__IO_REG32_BIT(SCU_ENAIO1,                        0x40086C8C,__READ_WRITE ,__scu_enaio1_bits);
__IO_REG32_BIT(SCU_ENAIO2,                        0x40086C90,__READ_WRITE ,__scu_enaio2_bits);
__IO_REG32_BIT(SCU_EMCDELAYCLK,                   0x40086D00,__READ_WRITE ,__scu_emcdelayclk_bits);
__IO_REG32_BIT(SCU_PINTSEL0,                      0x40086E00,__READ_WRITE ,__scu_pintsel0_bits);
__IO_REG32_BIT(SCU_PINTSEL1,                      0x40086E04,__READ_WRITE ,__scu_pintsel1_bits);

/***************************************************************************
 **
 ** GIMA
 **
 ***************************************************************************/

__IO_REG32_BIT(GIMA_CAP0_0_IN,                    0x400C7000,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP0_1_IN,                    0x400C7004,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP0_2_IN,                    0x400C7008,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP0_3_IN,                    0x400C700C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_0_IN,                    0x400C7010,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_1_IN,                    0x400C7014,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_2_IN,                    0x400C7018,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP1_3_IN,                    0x400C701C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_0_IN,                    0x400C7020,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_1_IN,                    0x400C7024,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_2_IN,                    0x400C7028,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP2_3_IN,                    0x400C702C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_0_IN,                    0x400C7030,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_1_IN,                    0x400C7034,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_2_IN,                    0x400C7038,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CAP3_3_IN,                    0x400C703C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_0_IN,                    0x400C7040,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_1_IN,                    0x400C7044,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_2_IN,                    0x400C7048,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_3_IN,                    0x400C704C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_4_IN,                    0x400C7050,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_5_IN,                    0x400C7054,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_6_IN,                    0x400C7058,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_CTIN_7_IN,                    0x400C705C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_VADC_TRIGGER_IN,              0x400C7060,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_EVENTROUTER_13_IN,            0x400C7064,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_EVENTROUTER_14_IN,            0x400C7068,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_EVENTROUTER_16_IN,            0x400C706C,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_ADCSTART0_IN,                 0x400C7070,__READ_WRITE ,__gima_in_bits);
__IO_REG32_BIT(GIMA_ADCSTART1_IN,                 0x400C7074,__READ_WRITE ,__gima_in_bits);

/***************************************************************************
 **
 ** GPIO
 **
 ***************************************************************************/

__IO_REG32_BIT(GPIO_ISEL,         0x40087000,__READ_WRITE,__gpio_isel_bits);
__IO_REG32_BIT(GPIO_IENR,         0x40087004,__READ_WRITE,__gpio_ienr_bits);
__IO_REG32(    GPIO_SIENR,        0x40087008,__WRITE     );
__IO_REG32(    GPIO_CIENR,        0x4008700C,__WRITE     );
__IO_REG32_BIT(GPIO_IENF,         0x40087010,__READ_WRITE,__gpio_ienf_bits);
__IO_REG32(    GPIO_SIENF,        0x40087014,__WRITE     );
__IO_REG32(    GPIO_CIENF,        0x40087018,__WRITE     );
__IO_REG32_BIT(GPIO_RISE,         0x4008701C,__READ_WRITE,__gpio_rise_bits);
__IO_REG32_BIT(GPIO_FALL,         0x40087020,__READ_WRITE,__gpio_fall_bits);
__IO_REG32_BIT(GPIO_IST,          0x40087024,__READ_WRITE,__gpio_ist_bits);

__IO_REG32_BIT(GPIOG0_CTRL,       0x40088000,__READ_WRITE,__gpiogx_ctrl_bits);
__IO_REG32(    GPIOG0_PORT_POL0,  0x40088020,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL1,  0x40088024,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL2,  0x40088028,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL3,  0x4008802C,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL4,  0x40088030,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL5,  0x40088034,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL6,  0x40088038,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_POL7,  0x4008803C,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA0,  0x40088040,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA1,  0x40088044,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA2,  0x40088048,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA3,  0x4008804C,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA4,  0x40088050,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA5,  0x40088054,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA6,  0x40088058,__READ_WRITE);
__IO_REG32(    GPIOG0_PORT_ENA7,  0x4008805C,__READ_WRITE);

__IO_REG32_BIT(GPIOG1_CTRL,       0x40089000,__READ_WRITE,__gpiogx_ctrl_bits);
__IO_REG32(    GPIOG1_PORT_POL0,  0x40089020,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL1,  0x40089024,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL2,  0x40089028,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL3,  0x4008902C,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL4,  0x40089030,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL5,  0x40089034,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL6,  0x40089038,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_POL7,  0x4008903C,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA0,  0x40089040,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA1,  0x40089044,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA2,  0x40089048,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA3,  0x4008904C,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA4,  0x40089050,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA5,  0x40089054,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA6,  0x40089058,__READ_WRITE);
__IO_REG32(    GPIOG1_PORT_ENA7,  0x4008905C,__READ_WRITE);

__IO_REG8(     GPIO_B0,           0x400F4000,__READ_WRITE);
__IO_REG8(     GPIO_B1,           0x400F4001,__READ_WRITE);
__IO_REG8(     GPIO_B2,           0x400F4002,__READ_WRITE);
__IO_REG8(     GPIO_B3,           0x400F4003,__READ_WRITE);
__IO_REG8(     GPIO_B4,           0x400F4004,__READ_WRITE);
__IO_REG8(     GPIO_B5,           0x400F4005,__READ_WRITE);
__IO_REG8(     GPIO_B6,           0x400F4006,__READ_WRITE);
__IO_REG8(     GPIO_B7,           0x400F4007,__READ_WRITE);
__IO_REG8(     GPIO_B8,           0x400F4008,__READ_WRITE);
__IO_REG8(     GPIO_B9,           0x400F4009,__READ_WRITE);
__IO_REG8(     GPIO_B10,          0x400F400A,__READ_WRITE);
__IO_REG8(     GPIO_B11,          0x400F400B,__READ_WRITE);
__IO_REG8(     GPIO_B12,          0x400F400C,__READ_WRITE);
__IO_REG8(     GPIO_B13,          0x400F400D,__READ_WRITE);
__IO_REG8(     GPIO_B14,          0x400F400E,__READ_WRITE);
__IO_REG8(     GPIO_B15,          0x400F400F,__READ_WRITE);

