una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
__IO_REG32_BIT(DMACC1CONTROL,         0x4000212C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C1CONTROL      DMACC1CONTROL
#define GPDMA_C1CONTROL_bit  DMACC1CONTROL_bit

__IO_REG32_BIT(DMACC1CONFIGURATION,   0x40002130,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C1CONFIG      DMACC1CONFIGURATION
#define GPDMA_C1CONFIG_bit  DMACC1CONFIGURATION_bit

__IO_REG32(    DMACC2SRCADDR,         0x40002140,__READ_WRITE);
#define GPDMA_C2SRCADDR      DMACC2SRCADDR

__IO_REG32(    DMACC2DESTADDR,        0x40002144,__READ_WRITE);
#define GPDMA_C2DESTADDR      DMACC2DESTADDR

__IO_REG32_BIT(DMACC2LLI,             0x40002148,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C2LLI      DMACC2LLI
#define GPDMA_C2LLI_bit  DMACC2LLI_bit

__IO_REG32_BIT(DMACC2CONTROL,         0x4000214C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C2CONTROL      DMACC2CONTROL
#define GPDMA_C2CONTROL_bit  DMACC2CONTROL_bit

__IO_REG32_BIT(DMACC2CONFIGURATION,   0x40002150,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C2CONFIG      DMACC2CONFIGURATION
#define GPDMA_C2CONFIG_bit  DMACC2CONFIGURATION_bit

__IO_REG32(    DMACC3SRCADDR,         0x40002160,__READ_WRITE);
#define GPDMA_C3SRCADDR      DMACC3SRCADDR

__IO_REG32(    DMACC3DESTADDR,        0x40002164,__READ_WRITE);
#define GPDMA_C3DESTADDR      DMACC3DESTADDR

__IO_REG32_BIT(DMACC3LLI,             0x40002168,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C3LLI      DMACC3LLI
#define GPDMA_C3LLI_bit  DMACC3LLI_bit

__IO_REG32_BIT(DMACC3CONTROL,         0x4000216C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C3CONTROL      DMACC3CONTROL
#define GPDMA_C3CONTROL_bit  DMACC3CONTROL_bit

__IO_REG32_BIT(DMACC3CONFIGURATION,   0x40002170,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C3CONFIG      DMACC3CONFIGURATION
#define GPDMA_C3CONFIG_bit  DMACC3CONFIGURATION_bit

__IO_REG32(    DMACC4SRCADDR,         0x40002180,__READ_WRITE);
#define GPDMA_C4SRCADDR      DMACC4SRCADDR

__IO_REG32(    DMACC4DESTADDR,        0x40002184,__READ_WRITE);
#define GPDMA_C4DESTADDR      DMACC4DESTADDR

__IO_REG32_BIT(DMACC4LLI,             0x40002188,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C4LLI      DMACC4LLI
#define GPDMA_C4LLI_bit  DMACC4LLI_bit

__IO_REG32_BIT(DMACC4CONTROL,         0x4000218C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C4CONTROL      DMACC4CONTROL
#define GPDMA_C4CONTROL_bit  DMACC4CONTROL_bit

__IO_REG32_BIT(DMACC4CONFIGURATION,   0x40002190,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C4CONFIG      DMACC4CONFIGURATION
#define GPDMA_C4CONFIG_bit  DMACC4CONFIGURATION_bit

__IO_REG32(    DMACC5SRCADDR,         0x400021A0,__READ_WRITE);
#define GPDMA_C5SRCADDR      DMACC5SRCADDR

__IO_REG32(    DMACC5DESTADDR,        0x400021A4,__READ_WRITE);
#define GPDMA_C5DESTADDR      DMACC5DESTADDR

__IO_REG32_BIT(DMACC5LLI,             0x400021A8,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C5LLI      DMACC5LLI
#define GPDMA_C5LLI_bit  DMACC5LLI_bit

__IO_REG32_BIT(DMACC5CONTROL,         0x400021AC,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C5CONTROL      DMACC5CONTROL
#define GPDMA_C5CONTROL_bit  DMACC5CONTROL_bit

__IO_REG32_BIT(DMACC5CONFIGURATION,   0x400021B0,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C5CONFIG      DMACC5CONFIGURATION
#define GPDMA_C5CONFIG_bit  DMACC5CONFIGURATION_bit

__IO_REG32(    DMACC6SRCADDR,         0x400021C0,__READ_WRITE);
#define GPDMA_C6SRCADDR      DMACC6SRCADDR

__IO_REG32(    DMACC6DESTADDR,        0x400021C4,__READ_WRITE);
#define GPDMA_C6DESTADDR      DMACC6DESTADDR

__IO_REG32_BIT(DMACC6LLI,             0x400021C8,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C6LLI      DMACC6LLI
#define GPDMA_C6LLI_bit  DMACC6LLI_bit

__IO_REG32_BIT(DMACC6CONTROL,         0x400021CC,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C6CONTROL      DMACC6CONTROL
#define GPDMA_C6CONTROL_bit  DMACC6CONTROL_bit

__IO_REG32_BIT(DMACC6CONFIGURATION,   0x400021D0,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C6CONFIG      DMACC6CONFIGURATION
#define GPDMA_C6CONFIG_bit  DMACC6CONFIGURATION_bit

__IO_REG32(    DMACC7SRCADDR,         0x400021E0,__READ_WRITE);
#define GPDMA_C7SRCADDR      DMACC7SRCADDR

__IO_REG32(    DMACC7DESTADDR,        0x400021E4,__READ_WRITE);
#define GPDMA_C7DESTADDR      DMACC7DESTADDR

__IO_REG32_BIT(DMACC7LLI,             0x400021E8,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C7LLI      DMACC7LLI
#define GPDMA_C7LLI_bit  DMACC7LLI_bit

__IO_REG32_BIT(DMACC7CONTROL,         0x400021EC,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C7CONTROL      DMACC7CONTROL
#define GPDMA_C7CONTROL_bit  DMACC7CONTROL_bit

__IO_REG32_BIT(DMACC7CONFIGURATION,   0x400021F0,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C7CONFIG      DMACC7CONFIGURATION
#define GPDMA_C7CONFIG_bit  DMACC7CONFIGURATION_bit

/***************************************************************************
 **
 ** SDIO
 **
 ***************************************************************************/
__IO_REG32_BIT(SDIO_CTRL,             0x40004000,__READ_WRITE ,__sdio_ctrl_bits);
__IO_REG32_BIT(SDIO_PWREN,            0x40004004,__READ_WRITE ,__sdio_pwren_bits);
__IO_REG32_BIT(SDIO_CLKDIV,           0x40004008,__READ_WRITE ,__sdio_clkdiv_bits);
__IO_REG32_BIT(SDIO_CLKSRC,           0x4000400C,__READ_WRITE ,__sdio_clksrc_bits);
__IO_REG32_BIT(SDIO_CLKENA,           0x40004010,__READ_WRITE ,__sdio_clkena_bits);
__IO_REG32_BIT(SDIO_TMOUT,            0x40004014,__READ_WRITE ,__sdio_tmout_bits);
__IO_REG32_BIT(SDIO_CTYPE,            0x40004018,__READ_WRITE ,__sdio_ctype_bits);
__IO_REG32_BIT(SDIO_BLKSIZ,           0x4000401C,__READ_WRITE ,__sdio_blksiz_bits);
__IO_REG32(    SDIO_BYTCNT,           0x40004020,__READ_WRITE );
__IO_REG32_BIT(SDIO_INTMASK,          0x40004024,__READ_WRITE ,__sdio_intmask_bits);
__IO_REG32(    SDIO_CMDARG,           0x40004028,__READ_WRITE );
__IO_REG32_BIT(SDIO_CMD,              0x4000402C,__READ_WRITE ,__sdio_cmd_bits);
__IO_REG32(    SDIO_RESP0,            0x40004030,__READ       );
__IO_REG32(    SDIO_RESP1,            0x40004034,__READ       );
__IO_REG32(    SDIO_RESP2,            0x40004038,__READ       );
__IO_REG32(    SDIO_RESP3,            0x4000403C,__READ       );
__IO_REG32_BIT(SDIO_MINTSTS,          0x40004040,__READ       ,__sdio_mintsts_bits);
__IO_REG32_BIT(SDIO_RINTSTS,          0x40004044,__READ_WRITE ,__sdio_rintsts_bits);
__IO_REG32_BIT(SDIO_STATUS,           0x40004048,__READ       ,__sdio_status_bits);
__IO_REG32_BIT(SDIO_FIFOTH,           0x4000404C,__READ_WRITE ,__sdio_fifoth_bits);
__IO_REG32_BIT(SDIO_CDETECT,          0x40004050,__READ       ,__sdio_cdetect_bits);
__IO_REG32_BIT(SDIO_WRTPRT,           0x40004054,__READ       ,__sdio_wrtprt_bits);
/*__IO_REG32_BIT(SDIO_GPIO,             0x40004058,__READ_WRITE ,__sdio_gpio_bits);*/
__IO_REG32(    SDIO_TCBCNT,           0x4000405C,__READ       );
__IO_REG32(    SDIO_TBBCNT,           0x40004060,__READ       );
__IO_REG32_BIT(SDIO_DEBNCE,           0x40004064,__READ_WRITE ,__sdio_debnce_bits);
/*__IO_REG32(    SDIO_USRID,            0x40004068,__READ_WRITE );*/
/*__IO_REG32(    SDIO_VERID,            0x4000406C,__READ       );*/
__IO_REG32_BIT(SDIO_UHS_REG,          0x40004074,__READ_WRITE ,__sdio_uhs_reg_bits);
__IO_REG32_BIT(SDIO_RST_N,            0x40004078,__READ_WRITE ,__sdio_rst_n_bits);
__IO_REG32_BIT(SDIO_BMOD,             0x40004080,__READ_WRITE ,__sdio_bmod_bits);
__IO_REG32(    SDIO_PLDMND,           0x40004084,__WRITE      );
__IO_REG32(    SDIO_DBADDR,           0x40004088,__READ_WRITE );
__IO_REG32_BIT(SDIO_IDSTS,            0x4000408C,__READ_WRITE ,__sdio_idsts_bits);
__IO_REG32_BIT(SDIO_IDINTEN,          0x40004090,__READ_WRITE ,__sdio_idinten_bits);
__IO_REG32(    SDIO_DSCADDR,          0x40004094,__READ       );
__IO_REG32(    SDIO_BUFADDR,          0x40004098,__READ       );
__IO_REG32(    SDIO_DATA,             0x40004100,__READ_WRITE );

/***************************************************************************
 **
 ** EMC
 **
 ***************************************************************************/
__IO_REG32_BIT(EMC_CONTROL,            0x40005000,__READ_WRITE ,__emc_control_bits);
__IO_REG32_BIT(EMC_STATUS,             0x40005004,__READ       ,__emc_status_bits);
__IO_REG32_BIT(EMC_CONFIG,             0x40005008,__READ_WRITE ,__emc_config_bits);
__IO_REG32_BIT(EMC_DYNAMICCONTROL,     0x40005020,__READ_WRITE ,__emc_dctrl_bits);
__IO_REG32_BIT(EMC_DYNAMICREFRESH,     0x40005024,__READ_WRITE ,__emc_drfr_bits);
__IO_REG32_BIT(EMC_DYNAMICREADCONFIG,  0x40005028,__READ_WRITE ,__emc_drdcfg_bits);
__IO_REG32_BIT(EMC_DYNAMICRP,          0x40005030,__READ_WRITE ,__emc_drp_bits);
__IO_REG32_BIT(EMC_DYNAMICRAS,         0x40005034,__READ_WRITE ,__emc_dras_bits);
__IO_REG32_BIT(EMC_DYNAMICSREX,        0x40005038,__READ_WRITE ,__emc_dsrex_bits);
__IO_REG32_BIT(EMC_DYNAMICAPR,         0x4000503C,__READ_WRITE ,__emc_dapr_bits);
__IO_REG32_BIT(EMC_DYNAMICDAL,         0x40005040,__READ_WRITE ,__emc_ddal_bits);
__IO_REG32_BIT(EMC_DYNAMICWR,          0x40005044,__READ_WRITE ,__emc_dwr_bits);
__IO_REG32_BIT(EMC_DYNAMICRC,          0x40005048,__READ_WRITE ,__emc_drc_bits);
__IO_REG32_BIT(EMC_DYNAMICRFC,         0x4000504C,__READ_WRITE ,__emc_drfc_bits);
__IO_REG32_BIT(EMC_DYNAMICXSR,         0x40005050,__READ_WRITE ,__emc_dxsr_bits);
__IO_REG32_BIT(EMC_DYNAMICRRD,         0x40005054,__READ_WRITE ,__emc_drrd_bits);
__IO_REG32_BIT(EMC_DYNAMICMRD,         0x40005058,__READ_WRITE ,__emc_dmrd_bits);
__IO_REG32_BIT(EMC_STATICEXTENDEDWAIT, 0x40005080,__READ_WRITE ,__emc_s_ext_wait_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG0,     0x40005100,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS0,     0x40005104,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG1,     0x40005120,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS1,     0x40005124,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG2,     0x40005140,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS2,     0x40005144,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG3,     0x40005160,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS3,     0x40005164,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_STATICCONFIG0,      0x40005200,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN0,     0x40005204,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN0,     0x40005208,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD0,      0x4000520C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE0,    0x40005210,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR0,      0x40005214,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN0,    0x40005218,__READ_WRITE ,__emc_s_wait_turn_bits);
__IO_REG32_BIT(EMC_STATICCONFIG1,      0x40005220,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN1,     0x40005224,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN1,     0x40005228,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD1,      0x4000522C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE1,    0x40005230,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR1,      0x40005234,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN1,    0x40005238,__READ_WRITE ,__emc_s_wait_turn_bits);
__IO_REG32_BIT(EMC_STATICCONFIG2,      0x40005240,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN2,     0x40005244,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN2,     0x40005248,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD2,      0x4000524C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE2,    0x40005250,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR2,      0x40005254,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN2,    0x40005258,__READ_WRITE ,__emc_s_wait_turn_bits);
__IO_REG32_BIT(EMC_STATICCONFIG3,      0x40005260,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN3,     0x40005264,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN3,     0x40005268,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD3,      0x4000526C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE3,    0x40005270,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR3,      0x40005274,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN3,    0x40005278,__READ_WRITE ,__emc_s_wait_turn_bits);

/***************************************************************************
 **
 ** USB0
 **
 ***************************************************************************/
__IO_REG32_BIT(USB0_CAPLENGTH,        0x40006100,__READ      ,__usb_caplength_reg_bits);
__IO_REG32_BIT(USB0_HCSPARAMS,        0x40006104,__READ      ,__usb_hcsparams_reg_bits);
__IO_REG32_BIT(USB0_HCCPARAMS,        0x40006108,__READ      ,__usb_hccparams_reg_bits);
__IO_REG32_BIT(USB0_DCIVERSION,       0x40006120,__READ      ,__usb_dciversion_reg_bits);
__IO_REG32_BIT(USB0_DCCPARAMS,        0x40006124,__READ      ,__usb_dccparams_reg_bits);
__IO_REG32_BIT(USB0_USBCMD,           0x40006140,__READ_WRITE,__usb_usbcmd_reg_bits);
#define USB0_USBCMD_D         USB0_USBCMD
#define USB0_USBCMD_D_bit     USB0_USBCMD_bit
#define USB0_USBCMD_H         USB0_USBCMD
#define USB0_USBCMD_H_bit     USB0_USBCMD_bit
__IO_REG32_BIT(USB0_USBSTS,           0x40006144,__READ_WRITE,__usb_usbsts_reg_bits);
#define USB0_USBSTS_D         USB0_USBSTS
#define USB0_USBSTS_D_bit     USB0_USBSTS_bit
#define USB0_USBSTS_H         USB0_USBSTS
#define USB0_USBSTS_H_bit     USB0_USBSTS_bit
__IO_REG32_BIT(USB0_USBINTR,          0x40006148,__READ_WRITE,__usb_usbintr_reg_bits);
#define USB0_USBINTR_D         USB0_USBINTR
#define USB0_USBINTR_D_bit     USB0_USBINTR_bit
#define USB0_USBINTR_H         USB0_USBINTR
#define USB0_USBINTR_H_bit     USB0_USBINTR_bit
__IO_REG32_BIT(USB0_FRINDEX,          0x4000614C,__READ_WRITE,__usb_frindex_bits);
#define USB0_FRINDEX_D         USB0_FRINDEX
#define USB0_FRINDEX_D_bit     USB0_FRINDEX_bit
#define USB0_FRINDEX_H         USB0_FRINDEX
#define USB0_FRINDEX_H_bit     USB0_FRINDEX_bit
__IO_REG32_BIT(USB0_PERIODICLISTBASE, 0x40006154,__READ_WRITE,__usb_periodiclistbase_reg_bits);
#define USB0_DEVICEADDR             USB0_PERIODICLISTBASE
#define USB0_DEVICEADDR_bit         USB0_PERIODICLISTBASE_bit
__IO_REG32_BIT(USB0_ASYNCLISTADDR,    0x40006158,__READ_WRITE,__usb_asynclistaddr_reg_bits);
#define USB0_ENDPOINTLISTADDR       USB0_ASYNCLISTADDR
#define USB0_ENDPOINTLISTADDR_bit   USB0_ASYNCLISTADDR_bit
__IO_REG32_BIT(USB0_TTCTRL,           0x4000615C,__READ_WRITE,__usb_ttctrl_reg_bits);
__IO_REG32_BIT(USB0_BURSTSIZE,        0x40006160,__READ_WRITE,__usb_burstsize_reg_bits);
__IO_REG32_BIT(USB0_TXFILLTUNING,     0x40006164,__READ_WRITE,__usb_txfilltuning_reg_bits);
__IO_REG32_BIT(USB0_BINTERVAL,        0x40006174,__READ_WRITE,__usb_binterval_reg_bits);
__IO_REG32_BIT(USB0_ENDPTNAK,         0x40006178,__READ_WRITE,__usb_endptnak_reg_bits);
__IO_REG32_BIT(USB0_ENDPTNAKEN,       0x4000617C,__READ_WRITE,__usb_endptnaken_reg_bits);
__IO_REG32_BIT(USB0_PORTSC1,          0x40006184,__READ_WRITE,__usb_portsc1_reg_bits);
#define USB0_PORTSC1_D         USB0_PORTSC1
#define USB0_PORTSC1_D_bit     USB0_PORTSC1_bit
#define USB0_PORTSC1_H         USB0_PORTSC1
#define USB0_PORTSC1_H_bit     USB0_PORTSC1_bit
__IO_REG32_BIT(USB0_OTGSC,            0x400061A4,__READ_WRITE,__usb_otgsc_reg_bits);
__IO_REG32_BIT(USB0_USBMODE,          0x400061A8,__READ_WRITE,__usb_usbmode_reg_bits);
#define USB0_USBMODE_D         USB0_USBMODE
#define USB0_USBMODE_D_bit     USB0_USBMODE_bit
#define USB0_USBMODE_H         USB0_USBMODE
#define USB0_USBMODE_H_bit     USB0_USBMODE_bit
__IO_REG32_BIT(USB0_ENDPTSETUPSTAT,   0x400061AC,__READ_WRITE,__usb_endptsetupstat_reg_bits);
__IO_REG32_BIT(USB0_ENDPTPRIME,       0x400061B0,__READ_WRITE,__usb_endptprime_reg_bits);
__IO_REG32_BIT(USB0_ENDPTFLUSH,       0x400061B4,__READ_WRITE,__usb_endptflush_reg_bits);
__IO_REG32_BIT(USB0_ENDPTSTAT,        0x400061B8,__READ_WRITE,__usb_endptstatus_reg_bits);
__IO_REG32_BIT(USB0_ENDPTCOMPLETE,    0x400061BC,__READ_WRITE,__usb_endptcomplete_reg_bits);
__IO_REG32_BIT(USB0_ENDPTCTRL0,       0x400061C0,__READ_WRITE,__usb_endptctrl0_reg_bits);
__IO_REG32_BIT(USB0_ENDPTCTRL1,       0x400061C4,__READ_WRITE,__usb_endptctrl_reg_bits);
__IO_REG32_BIT(USB0_ENDPTCTRL2,       0x400061C8,__READ_WRITE,__usb_endptctrl_reg_bits);
__IO_REG32_BIT(USB0_ENDPTCTRL3,       0x400061CC,__READ_WRITE,__usb_endptctrl_reg_bits);
__IO_REG32_BIT(USB0_ENDPTCTRL4,       0x400061D0,__READ_WRITE,__usb_endptctrl_reg_bits);
__IO_REG32_BIT(USB0_ENDPTCTRL5,       0x400061D4,__READ_WRITE,__usb_endptctrl_reg_bits);

/***************************************************************************
 **
 ** USB1
 **
 ***************************************************************************/
__IO_REG32_BIT(USB1_CAPLENGTH,        0x40007100,__READ      ,__usb_caplength_reg_bits);
__IO_REG32_BIT(USB1_HCSPARAMS,        0x40007104,__READ      ,__usb_hcsparams_reg_bits);
__IO_REG32_BIT(USB1_HCCPARAMS,        0x40007108,__READ      ,__usb_hccparams_reg_bits);
__IO_REG32_BIT(USB1_DCIVERSION,       0x40007120,__READ      ,__usb_dciversion_reg_bits);
__IO_REG32_BIT(USB1_DCCPARAMS,        0x40007124,__READ      ,__usb_dccparams_reg_bits);
__IO_REG32_BIT(USB1_USBCMD,           0x40007140,__READ_WRITE,__usb_usbcmd_reg_bits);
#define USB1_USBCMD_D         USB0_USBCMD
#define USB1_USBCMD_D_bit     USB0_USBCMD_bit
#define USB1_USBCMD_H         USB0_USBCMD
#define USB1_USBCMD_H_bit     USB0_USBCMD_bit
__IO_REG32_BIT(USB1_USBSTS,           0x40007144,__READ_WRITE,__usb_usbsts_reg_bits);
#define USB1_USBSTS_D         USB0_USBSTS
#define USB1_USBSTS_D_bit     USB0_USBSTS_bit
#define USB1_USBSTS_H         USB0_USBSTS
#define USB1_USBSTS_H_bit     USB0_USBSTS_bit
__IO_REG32_BIT(USB1_USBINTR,          0x40007148,__READ_WRITE,__usb_usbintr_reg_bits);
#define USB1_USBINTR_D         USB0_USBINTR
#define USB1_USBINTR_D_bit     USB0_USBINTR_bit
#define USB1_USBINTR_H         USB0_USBINTR
#define USB1_USBINTR_H_bit     USB0_USBINTR_bit
__IO_REG32(    USB1_FRINDEX,          0x4000714C,__READ_WRITE);
#define USB1_FRINDEX_D         USB0_FRINDEX
#define USB1_FRINDEX_D_bit     USB0_FRINDEX_bit
#define USB1_FRINDEX_H         USB0_FRINDEX
#define USB1_FRINDEX_H_bit     USB0_FRINDEX_bit
__IO_REG32_BIT(USB1_PERIODICLISTBASE, 0x40007154,__READ_WRITE,__usb_periodiclistbase_reg_bits);
#define USB1_DEVICEADDR          USB1_PERIODICLISTBASE
#define USB1_DEVICEADDR_bit      USB1_PERIODICLISTBASE_bit
__IO_REG32_BIT(USB1_ASYNCLISTADDR,    0x40007158,__READ_WRITE,__usb_asynclistaddr_reg_bits);
#define USB1_ENDPOINTLISTADDR       USB1_ASYNCLISTADDR
#define USB1_ENDPOINTLISTADDR_bit   USB1_ASYNCLISTADDR_bit
__IO_REG32_BIT(USB1_TTCTRL,           0x4000715C,__READ_WRITE,__usb_ttctrl_reg_bits);
__IO_REG32_BIT(USB1_BURSTSIZE,        0x40007160,__READ_WRITE,__usb_burstsize_reg_bits);
__IO_REG32_BIT(USB1_TXFILLTUNING,     0x40007164,__READ_WRITE,__usb_txfilltuning_reg_bits);
__IO_REG32_BIT(USB1_ULPIVIEWPORT,     0x40007170,__READ_WRITE,__usb1_ulpiviewport_reg_bits);
__IO_REG32_BIT(USB1_BINTERVAL,        0x40007174,__READ_WRITE,__usb_binterval_reg_bits);
__IO_REG32_BIT(USB1_ENDPTNAK,         0x40007178,__READ_WRITE,__usb1_endptnak_reg_bits);
__IO_REG32_BIT(USB1_ENDPTNAKEN,       0x4000717C,__READ_WRITE,__usb1_endptnaken_reg_bits);
__IO_REG32_BIT(USB1_PORTSC1,          0x40007184,__READ_WRITE,__usb_portsc1_reg_bits);
#define USB1_PORTSC1_D         USB0_PORTSC1
#define USB1_PORTSC1_D_bit     USB0_PORTSC1_bit
#define USB1_PORTSC1_H         USB0_PORTSC1
#define USB1_PORTSC1_H_bit     USB0_PORTSC1_bit
__IO_REG32_BIT(USB1_USBMODE,          0x400071A8,__READ_WRITE,__usb_usbmode_reg_bits);
#define USB1_USBMODE_D         USB0_USBMODE
#define USB1_USBMODE_D_bit     USB0_USBMODE_bit
#define USB1_USBMODE_H         USB0_USBMODE
#define USB1_USBMODE_H_bit     USB0_USBMODE_bit
__IO_REG32_BIT(USB1_ENDPTSETUPSTAT,   0x400071AC,__READ_WRITE,__usb1_endptsetupstat_reg_bits);
__IO_REG32_BIT(USB1_ENDPTPRIME,       0x400071B0,__READ_WRITE,__usb1_endptprime_reg_bits);
__IO_REG32_BIT(USB1_ENDPTFLUSH,       0x400071B4,__READ_WRITE,__usb1_endptflush_reg_bits);
__IO_REG32_BIT(USB1_ENDPTSTAT,        0x400071B8,__READ_WRITE,__usb1_endptstatus_reg_bits);
__IO_REG32_BIT(USB1_ENDPTCOMPLETE,    0x400071BC,__READ_WRITE,__usb1_endptcomplete_reg_bits);
__IO_REG32_BIT(USB1_ENDPTCTRL0,       0x400071C0,__READ_WRITE,__usb_endptctrl0_reg_bits);
__IO_REG32_BIT(USB1_ENDPTCTRL1,       0x400071C4,__READ_WRITE,__usb_endptctrl_reg_bits);
__IO_REG32_BIT(USB1_ENDPTCTRL2,       0x400071C8,__READ_WRITE,__usb_endptctrl_reg_bits);
__IO_REG32_BIT(USB1_ENDPTCTRL3,       0x400071CC,__READ_WRITE,__usb_endptctrl_reg_bits);

/***************************************************************************
 **
 ** Ethernet
 **
 ***************************************************************************/
__IO_REG32_BIT(ETH_MAC_CONFIG,            0x40010000,__READ_WRITE,__eth_mac_config_bits);
__IO_REG32_BIT(ETH_MAC_FRAME_FILTER,      0x40010004,__READ_WRITE,__eth_mac_frame_filter_bits);
__IO_REG32(    ETH_MAC_HASHTABLE_HIGH,    0x40010008,__READ_WRITE);
__IO_REG32(    ETH_MAC_HASHTABLE_LOW,     0x4001000C,__READ_WRITE);
__IO_REG32_BIT(ETH_MAC_MII_ADDR,          0x40010010,__READ_WRITE,__eth_mac_gmii_addr_bits);
__IO_REG32_BIT(ETH_MAC_MII_DATA,          0x40010014,__READ_WRITE,__eth_mac_gmii_data_bits);
__IO_REG32_BIT(ETH_MAC_FLOW_CTRL,         0x40010018,__READ_WRITE,__eth_mac_flow_ctrl_bits);
__IO_REG32_BIT(ETH_MAC_VLAN_TAG,          0x4001001C,__READ_WRITE,__eth_mac_vlan_tag_bits);
__IO_REG32_BIT(ETH_MAC_DEBUG,             0x40010024,__READ      ,__eth_mac_debug_bits);
__IO_REG32(    ETH_MAC_RWAKE_FRFLT,       0x40010028,__READ_WRITE);
__IO_REG32_BIT(ETH_MAC_PMT_CTRL_STAT,     0x4001002C,__READ_WRITE,__eth_mac_pmt_ctrl_stat_bits);
__IO_REG32(    ETH_MAC_INTR,              0x40010038,__READ      );
__IO_REG32_BIT(ETH_MAC_INTR_MASK,         0x4001003C,__READ_WRITE,__eth_mac_intr_mask_bits);
__IO_REG32_BIT(ETH_MAC_ADDR0_HIGH,        0x40010040,__READ_WRITE,__eth_mac_addr0_high_bits);
__IO_REG32(    ETH_MAC_ADDR0_LOW,         0x40010044,__READ_WRITE);
__IO_REG32_BIT(ETH_MAC_TIMESTP_CTRL,      0x40010700,__READ_WRITE,__eth_mac_timestp_ctrl_bits);

