una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
__IO_REG32_BIT(ETH_SUBSECOND_INCR,        0x40010704,__READ_WRITE,__eth_subsecond_incr_bits);
__IO_REG32_BIT(ETH_SECONDS,               0x40010708,__READ      ,__eth_seconds_bits);
__IO_REG32_BIT(ETH_NANOSECONDS,           0x4001070C,__READ      ,__eth_nanoseconds_bits);
__IO_REG32_BIT(ETH_SECONDSUPDATE,         0x40010710,__READ_WRITE,__eth_seconds_bits);
__IO_REG32_BIT(ETH_NANOSECONDSUPDATE,     0x40010714,__READ_WRITE,__eth_nanosecondsupdate_bits);
__IO_REG32_BIT(ETH_ADDEND,                0x40010718,__READ_WRITE,__eth_addend_bits);
__IO_REG32_BIT(ETH_TARGETSECONDS,         0x4001071C,__READ_WRITE,__eth_targetseconds_bits);
__IO_REG32_BIT(ETH_TARGETNANOSECONDS,     0x40010720,__READ_WRITE,__eth_targetnanoseconds_bits);
__IO_REG32_BIT(ETH_HIGHWORD,              0x40010724,__READ_WRITE,__eth_highword_bits);
__IO_REG32_BIT(ETH_TIMESTAMPSTAT,         0x40010728,__READ      ,__eth_timestampstat_bits);
__IO_REG32_BIT(ETH_PPSCTRL,               0x4001072C,__READ_WRITE,__eth_ppsctrl_bits);
__IO_REG32_BIT(ETH_AUXNANOSECONDS,        0x40010730,__READ      ,__eth_auxnanoseconds_bits);
__IO_REG32_BIT(ETH_AUXSECONDS,            0x40010734,__READ      ,__eth_auxseconds_bits);

__IO_REG32_BIT(ETH_DMA_BUS_MODE,          0x40011000,__READ_WRITE,__eth_dma_bus_mode_bits);
__IO_REG32(    ETH_DMA_TRANS_POLL_DEMAND, 0x40011004,__READ_WRITE);
__IO_REG32(    ETH_DMA_REC_POLL_DEMAND,   0x40011008,__READ_WRITE);
__IO_REG32(    ETH_DMA_REC_DES_ADDR,      0x4001100C,__READ_WRITE);
__IO_REG32(    ETH_DMA_TRANS_DES_ADDR,    0x40011010,__READ_WRITE);
__IO_REG32_BIT(ETH_DMA_STAT,              0x40011014,__READ_WRITE,__eth_dma_stat_bits);
__IO_REG32_BIT(ETH_DMA_OP_MODE,           0x40011018,__READ_WRITE,__eth_dma_op_mode_bits);
__IO_REG32_BIT(ETH_DMA_INT_EN,            0x4001101C,__READ_WRITE,__eth_dma_int_en_bits);
__IO_REG32_BIT(ETH_DMA_MFRM_BUFOF,        0x40011020,__READ      ,__eth_dma_mfrm_bufof_bits);
__IO_REG32_BIT(ETH_DMA_REC_INT_WDT,       0x40011024,__READ_WRITE,__eth_dma_rec_int_wdt_bits);
__IO_REG32(    ETH_DMA_CURHOST_TRANS_DES, 0x40011048,__READ      );
__IO_REG32(    ETH_DMA_CURHOST_REC_DES,   0x4001104C,__READ      );
__IO_REG32(    ETH_DMA_CURHOST_TRANS_BUF, 0x40011050,__READ      );
__IO_REG32(    ETH_DMA_CURHOST_REC_BUF,   0x40011054,__READ      );

/***************************************************************************
 **
 ** SCT
 **
 ***************************************************************************/
__IO_REG32_BIT(SCT_CONFIG,             0x40000000,__READ_WRITE ,__sct_config_bits);
__IO_REG32_BIT(SCT_CTRL,               0x40000004,__READ_WRITE ,__sct_ctrl_bits);
#define SCT_CTRL_L       SCT_CTRL_bit.__sct_ctrl_l
#define SCT_CTRL_L_bit   SCT_CTRL_bit.__sct_ctrl_l_bits
#define SCT_CTRL_H       SCT_CTRL_bit.__sct_ctrl_h
#define SCT_CTRL_H_bit   SCT_CTRL_bit.__sct_ctrl_h_bits
__IO_REG32_BIT(SCT_LIMIT,              0x40000008,__READ_WRITE ,__sct_limit_bits);
#define SCT_LIMIT_L       SCT_LIMIT_bit.__sct_limit_l
#define SCT_LIMIT_L_bit   SCT_LIMIT_bit.__sct_limit_l_bits
#define SCT_LIMIT_H       SCT_LIMIT_bit.__sct_limit_h
#define SCT_LIMIT_H_bit   SCT_LIMIT_bit.__sct_limit_h_bits
__IO_REG32_BIT(SCT_HALT,               0x4000000C,__READ_WRITE ,__sct_halt_bits);
#define SCT_HALT_L       SCT_HALT_bit.__sct_halt_l
#define SCT_HALT_L_bit   SCT_HALT_bit.__sct_halt_l_bits
#define SCT_HALT_H       SCT_HALT_bit.__sct_halt_h
#define SCT_HALT_H_bit   SCT_HALT_bit.__sct_halt_h_bits
__IO_REG32_BIT(SCT_STOP,               0x40000010,__READ_WRITE ,__sct_stop_bits);
#define SCT_STOP_L       SCT_STOP_bit.__sct_stop_l
#define SCT_STOP_L_bit   SCT_STOP_bit.__sct_stop_l_bits
#define SCT_STOP_H       SCT_STOP_bit.__sct_stop_h
#define SCT_STOP_H_bit   SCT_STOP_bit.__sct_stop_h_bits
__IO_REG32_BIT(SCT_START,              0x40000014,__READ_WRITE ,__sct_start_bits);
#define SCT_START_L       SCT_START_bit.__sct_start_l
#define SCT_START_L_bit   SCT_START_bit.__sct_start_l_bits
#define SCT_START_H       SCT_START_bit.__sct_start_h
#define SCT_START_H_bit   SCT_START_bit.__sct_start_h_bits
__IO_REG32_BIT(SCT_COUNT,              0x40000040,__READ_WRITE ,__sct_count_bits);
#define SCT_COUNT_L       SCT_COUNT_bit.__sct_count_l
#define SCT_COUNT_H       SCT_COUNT_bit.__sct_count_h
__IO_REG32_BIT(SCT_STATE,              0x40000044,__READ_WRITE ,__sct_state_bits);
#define SCT_STATE_L       SCT_STATE_bit.__sct_state_l
#define SCT_STATE_L_bit   SCT_STATE_bit.__sct_state_l_bits
#define SCT_STATE_H       SCT_STATE_bit.__sct_state_h
#define SCT_STATE_H_bit   SCT_STATE_bit.__sct_state_h_bits
__IO_REG32_BIT(SCT_INPUT,              0x40000048,__READ       ,__sct_input_bits);
__IO_REG32_BIT(SCT_REGMODE,            0x4000004C,__READ_WRITE ,__sct_regmode_bits);
#define SCT_REGMODE_L       SCT_REGMODE_bit.__sct_regmode_l
#define SCT_REGMODE_L_bit   SCT_REGMODE_bit.__sct_regmode_l_bits
#define SCT_REGMODE_H       SCT_REGMODE_bit.__sct_regmode_h
#define SCT_REGMODE_H_bit   SCT_REGMODE_bit.__sct_regmode_h_bits
__IO_REG32_BIT(SCT_OUTPUT,             0x40000050,__READ_WRITE ,__sct_output_bits);
__IO_REG32_BIT(SCT_OUTPUTDIRCTRL,      0x40000054,__READ_WRITE ,__sct_outputdirctrl_bits);
__IO_REG32_BIT(SCT_RES,                0x40000058,__READ_WRITE ,__sct_res_bits);
__IO_REG32_BIT(SCT_DMAREQ0,            0x4000005C,__READ_WRITE ,__sct_dmareq0_bits);
__IO_REG32_BIT(SCT_DMAREQ1,            0x40000060,__READ_WRITE ,__sct_dmareq1_bits);
__IO_REG32_BIT(SCT_EVEN,               0x400000F0,__READ_WRITE ,__sct_even_bits);
__IO_REG32_BIT(SCT_EVFLAG,             0x400000F4,__READ_WRITE ,__sct_evflag_bits);
__IO_REG32_BIT(SCT_CONEN,              0x400000F8,__READ_WRITE ,__sct_conen_bits);
__IO_REG32_BIT(SCT_CONFLAG,            0x400000FC,__READ_WRITE ,__sct_conflag_bits);
__IO_REG32_BIT(SCT_MATCH0,             0x40000100,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP0             SCT_MATCH0
#define SCT_CAP0_bit         SCT_MATCH0_bit
#define SCT_MATCH0_L         SCT_MATCH0_bit.__sct_match_cap_l
#define SCT_MATCH0_H         SCT_MATCH0_bit.__sct_match_cap_h
#define SCT_CAP0_L           SCT_MATCH0_bit.__sct_match_cap_l
#define SCT_CAP0_H           SCT_MATCH0_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH1,             0x40000104,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP1             SCT_MATCH1
#define SCT_CAP1_bit         SCT_MATCH1_bit
#define SCT_MATCH1_L         SCT_MATCH1_bit.__sct_match_cap_l
#define SCT_MATCH1_H         SCT_MATCH1_bit.__sct_match_cap_h
#define SCT_CAP1_L           SCT_MATCH1_bit.__sct_match_cap_l
#define SCT_CAP1_H           SCT_MATCH1_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH2,             0x40000108,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP2             SCT_MATCH2
#define SCT_CAP2_bit         SCT_MATCH2_bit
#define SCT_MATCH2_L         SCT_MATCH2_bit.__sct_match_cap_l
#define SCT_MATCH2_H         SCT_MATCH2_bit.__sct_match_cap_h
#define SCT_CAP2_L           SCT_MATCH2_bit.__sct_match_cap_l
#define SCT_CAP2_H           SCT_MATCH2_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH3,             0x4000010C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP3             SCT_MATCH3
#define SCT_CAP3_bit         SCT_MATCH3_bit
#define SCT_MATCH3_L         SCT_MATCH3_bit.__sct_match_cap_l
#define SCT_MATCH3_H         SCT_MATCH3_bit.__sct_match_cap_h
#define SCT_CAP3_L           SCT_MATCH3_bit.__sct_match_cap_l
#define SCT_CAP3_H           SCT_MATCH3_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH4,             0x40000110,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP4             SCT_MATCH4
#define SCT_CAP4_bit         SCT_MATCH4_bit
#define SCT_MATCH4_L         SCT_MATCH4_bit.__sct_match_cap_l
#define SCT_MATCH4_H         SCT_MATCH4_bit.__sct_match_cap_h
#define SCT_CAP4_L           SCT_MATCH4_bit.__sct_match_cap_l
#define SCT_CAP4_H           SCT_MATCH4_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH5,             0x40000114,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP5             SCT_MATCH5
#define SCT_CAP5_bit         SCT_MATCH5_bit
#define SCT_MATCH5_L         SCT_MATCH5_bit.__sct_match_cap_l
#define SCT_MATCH5_H         SCT_MATCH5_bit.__sct_match_cap_h
#define SCT_CAP5_L           SCT_MATCH5_bit.__sct_match_cap_l
#define SCT_CAP5_H           SCT_MATCH5_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH6,             0x40000118,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP6             SCT_MATCH6
#define SCT_CAP6_bit         SCT_MATCH6_bit
#define SCT_MATCH6_L         SCT_MATCH6_bit.__sct_match_cap_l
#define SCT_MATCH6_H         SCT_MATCH6_bit.__sct_match_cap_h
#define SCT_CAP6_L           SCT_MATCH6_bit.__sct_match_cap_l
#define SCT_CAP6_H           SCT_MATCH6_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH7,             0x4000011C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP7             SCT_MATCH7
#define SCT_CAP7_bit         SCT_MATCH7_bit
#define SCT_MATCH7_L         SCT_MATCH7_bit.__sct_match_cap_l
#define SCT_MATCH7_H         SCT_MATCH7_bit.__sct_match_cap_h
#define SCT_CAP7_L           SCT_MATCH7_bit.__sct_match_cap_l
#define SCT_CAP7_H           SCT_MATCH7_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH8,             0x40000120,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP8             SCT_MATCH8
#define SCT_CAP8_bit         SCT_MATCH8_bit
#define SCT_MATCH8_L         SCT_MATCH8_bit.__sct_match_cap_l
#define SCT_MATCH8_H         SCT_MATCH8_bit.__sct_match_cap_h
#define SCT_CAP8_L           SCT_MATCH8_bit.__sct_match_cap_l
#define SCT_CAP8_H           SCT_MATCH8_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH9,             0x40000124,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP9             SCT_MATCH9
#define SCT_CAP9_bit         SCT_MATCH9_bit
#define SCT_MATCH9_L         SCT_MATCH9_bit.__sct_match_cap_l
#define SCT_MATCH9_H         SCT_MATCH9_bit.__sct_match_cap_h
#define SCT_CAP9_L           SCT_MATCH9_bit.__sct_match_cap_l
#define SCT_CAP9_H           SCT_MATCH9_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH10,            0x40000128,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP10            SCT_MATCH10
#define SCT_CAP10_bit        SCT_MATCH10_bit
#define SCT_MATCH10_L        SCT_MATCH10_bit.__sct_match_cap_l
#define SCT_MATCH10_H        SCT_MATCH10_bit.__sct_match_cap_h
#define SCT_CAP10_L          SCT_MATCH10_bit.__sct_match_cap_l
#define SCT_CAP10_H          SCT_MATCH10_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH11,            0x4000012C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP11            SCT_MATCH11
#define SCT_CAP11_bit        SCT_MATCH11_bit
#define SCT_MATCH11_L        SCT_MATCH11_bit.__sct_match_cap_l
#define SCT_MATCH11_H        SCT_MATCH11_bit.__sct_match_cap_h
#define SCT_CAP11_L          SCT_MATCH11_bit.__sct_match_cap_l
#define SCT_CAP11_H          SCT_MATCH11_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH12,            0x40000130,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP12            SCT_MATCH12
#define SCT_CAP12_bit        SCT_MATCH12_bit
#define SCT_MATCH12_L        SCT_MATCH12_bit.__sct_match_cap_l
#define SCT_MATCH12_H        SCT_MATCH12_bit.__sct_match_cap_h
#define SCT_CAP12_L          SCT_MATCH12_bit.__sct_match_cap_l
#define SCT_CAP12_H          SCT_MATCH12_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH13,            0x40000134,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP13            SCT_MATCH13
#define SCT_CAP13_bit        SCT_MATCH13_bit
#define SCT_MATCH13_L        SCT_MATCH13_bit.__sct_match_cap_l
#define SCT_MATCH13_H        SCT_MATCH13_bit.__sct_match_cap_h
#define SCT_CAP13_L          SCT_MATCH13_bit.__sct_match_cap_l
#define SCT_CAP13_H          SCT_MATCH13_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH14,            0x40000138,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP14            SCT_MATCH14
#define SCT_CAP14_bit        SCT_MATCH14_bit
#define SCT_MATCH14_L        SCT_MATCH14_bit.__sct_match_cap_l
#define SCT_MATCH14_H        SCT_MATCH14_bit.__sct_match_cap_h
#define SCT_CAP14_L          SCT_MATCH14_bit.__sct_match_cap_l
#define SCT_CAP14_H          SCT_MATCH14_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH15,            0x4000013C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP15            SCT_MATCH15
#define SCT_CAP15_bit        SCT_MATCH15_bit
#define SCT_MATCH15_L        SCT_MATCH15_bit.__sct_match_cap_l
#define SCT_MATCH15_H        SCT_MATCH15_bit.__sct_match_cap_h
#define SCT_CAP15_L          SCT_MATCH15_bit.__sct_match_cap_l
#define SCT_CAP15_H          SCT_MATCH15_bit.__sct_match_cap_h

