una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/NXP/iolpc4330_m4.h
#define PWR_STATE_DEEP_SLEEP      0x003000AA
#define PWR_STATE_POWER_DOWN      0x0030FCBA
#define PWR_STATE_DEEP_POWER_DOWN 0x003FFF7F

#endif    /* __IOLPC4330_M4_H */

/*###DDF-INTERRUPT-BEGIN###
Interrupt0   = NMI            0x08
Interrupt1   = HardFault      0x0C
Interrupt2   = MemManage      0x10
Interrupt3   = BusFault       0x14
Interrupt4   = UsageFault     0x18
Interrupt5   = SVC            0x2C
Interrupt6   = DebugMon       0x30
Interrupt7   = PendSV         0x38
Interrupt8   = SysTick        0x3C
Interrupt9   = DAC            0x40
Interrupt10  = M0CORE         0x44
Interrupt11  = DMA            0x48
Interrupt12  = ETHERNET       0x54
Interrupt13  = SDIO           0x58
Interrupt14  = USB0           0x60
Interrupt15  = USB1           0x64
Interrupt16  = SCT            0x68
Interrupt17  = RITIMER        0x6C
Interrupt18  = TIMER0         0x70
Interrupt19  = TIMER1         0x74
Interrupt20  = TIMER2         0x78
Interrupt21  = TIMER3         0x7C
Interrupt22  = MCPWM          0x80
Interrupt23  = ADC0           0x84
Interrupt24  = I2C0           0x88
Interrupt25  = I2C1           0x8C
Interrupt26  = SPI            0x90
Interrupt27  = ADC1           0x94
Interrupt28  = SSP0           0x98
Interrupt29  = SSP1           0x9C
Interrupt30  = USART0         0xA0
Interrupt31  = UART1          0xA4
Interrupt32  = USART2         0xA8
Interrupt33  = USART3         0xAC
Interrupt34  = I2S0           0xB0
Interrupt35  = I2S1           0xB4
Interrupt36  = SPIFI          0xB8
Interrupt37  = SGPIO          0xBC
Interrupt38  = PIN_INT0       0xC0
Interrupt39  = PIN_INT1       0xC4
Interrupt40  = PIN_INT2       0xC8
Interrupt41  = PIN_INT3       0xCC
Interrupt42  = PIN_INT4       0xD0
Interrupt43  = PIN_INT5       0xD4
Interrupt44  = PIN_INT6       0xD8
Interrupt45  = PIN_INT7       0xDC
Interrupt46  = GINT0          0xE0
Interrupt47  = GINT1          0xE4
Interrupt48  = EVENTROUTER    0xE8
Interrupt49  = C_CAN1         0xEC
Interrupt50  = ATIMER         0xF8
Interrupt51  = RTC            0xFC
Interrupt52  = WWDT           0x104
Interrupt53  = C_CAN0         0x10C
Interrupt54  = QEI            0x110
###DDF-INTERRUPT-END###*/
